{"id": "1qzqm65", "subreddit": "lonely_advice", "created_utc": 1770599760, "author": "Unicornsrainbowsbc", "title": "Lonely but not alone", "selftext": "", "score": 3, "num_comments": 1, "url": "/r/loneliness/comments/1qzqh45/lonely_but_not_alone/", "permalink": "https://reddit.com/r/lonely_advice/comments/1qzqm65/lonely_but_not_alone/", "over_18": false, "removed_by_category": null}
{"id": "1qz1wxg", "subreddit": "lonely_advice", "created_utc": 1770533160, "author": "Available-Bread-2824", "title": "Friends", "selftext": "The only thing I want is to just get a friend (even just one), friends who are willing to accept me and support each other, I have done self-harm because I am so lonely and I was diagnosed with depression by a psychiatrist or psychologist.\n\nI'm 19 and I've been in my room for years because of bullying trauma. When I was a child, I would often watch them play, but when I forced myself to join in, they disliked me because of my personality.\n\nI hate myself ", "score": 1, "num_comments": 4, "url": "https://www.reddit.com/r/lonely_advice/comments/1qz1wxg/friends/", "permalink": "https://reddit.com/r/lonely_advice/comments/1qz1wxg/friends/", "over_18": false, "removed_by_category": null}
{"id": "1qwc2m2", "subreddit": "lonely_advice", "created_utc": 1770267368, "author": "CowdingGreenHorn", "title": "One of the hardest things to accept and that leads to loneliness is realizing that some of the people who you thought were there for you actually aren't", "selftext": "And now suddenly the endless lonely monotony of the future is laid out in front of you. It is a terrible feeling", "score": 3, "num_comments": 0, "url": "https://www.reddit.com/r/lonely_advice/comments/1qwc2m2/one_of_the_hardest_things_to_accept_and_that/", "permalink": "https://reddit.com/r/lonely_advice/comments/1qwc2m2/one_of_the_hardest_things_to_accept_and_that/", "over_18": false, "removed_by_category": null}
{"id": "1qu5v74", "subreddit": "lonely_advice", "created_utc": 1770062471, "author": null, "title": "I really need someone", "selftext": "I’m m21 and in college whenever I see the beautiful girl in campus I just like have a quick glance like oh she’s beautiful then lower my gaze, but let a girl have a convo with me and next thing I know I’m imagining my life with her takes weeks for me to calm my self down and convince my self it’s not happening. Had a final exam today 2hr text I took 1:30 so I left tired with a headache hopeful I did good have to wait for everyone to finish to get the results anyways as I’m walking to the dining hall singing softly I glanced at a girl by the reception (they usually do tours for people interested in joining) so I’m oh she’s cute then lower my sight but as I walk by she stood up excuse me u study here how is it and all and I notice she is sooo gorgeous so now I’m in “love” I have a headache heart racing every emotion at once lmao she kept asking I think I gave awkward answers but I’m tired couldn’t think properly. I have this crush on a classmate (if y’all want details let me know) but if I had a choice I would pick new girl all day. I basically really wish I convinced her to join would love to see her again if y’all got any tips for being alone or finding someone I would be happy to listen.", "score": 2, "num_comments": 1, "url": "https://www.reddit.com/r/lonely_advice/comments/1qu5v74/i_really_need_someone/", "permalink": "https://reddit.com/r/lonely_advice/comments/1qu5v74/i_really_need_someone/", "over_18": false, "removed_by_category": null}
{"id": "1qu5qzx", "subreddit": "lonely_advice", "created_utc": 1770062232, "author": "BusyPurpose7093", "title": "I can’t seem to form meaningful friendships", "selftext": "", "score": 3, "num_comments": 0, "url": "/r/socialskills/comments/1qu5q13/i_cant_seem_to_form_meaningful_friendships/", "permalink": "https://reddit.com/r/lonely_advice/comments/1qu5qzx/i_cant_seem_to_form_meaningful_friendships/", "over_18": false, "removed_by_category": null}
{"id": "1qjzl09", "subreddit": "lonely_advice", "created_utc": 1769100316, "author": "Lost_Cut_5592", "title": "I just got a reality check, now my confidence collapsed and I just feel like shit constantly", "selftext": "", "score": 3, "num_comments": 0, "url": "/r/malementalhealth/comments/1qjzkcp/i_just_got_a_reality_check_now_my_confidence/", "permalink": "https://reddit.com/r/lonely_advice/comments/1qjzl09/i_just_got_a_reality_check_now_my_confidence/", "over_18": false, "removed_by_category": null}
{"id": "1pf90v5", "subreddit": "lonely_advice", "created_utc": 1764974503, "author": "CowdingGreenHorn", "title": "When you're lonely all you want is someone to show that they care about you. It sounds simple and yet so far away for most of us", "selftext": "", "score": 3, "num_comments": 0, "url": "https://www.reddit.com/r/lonely_advice/comments/1pf90v5/when_youre_lonely_all_you_want_is_someone_to_show/", "permalink": "https://reddit.com/r/lonely_advice/comments/1pf90v5/when_youre_lonely_all_you_want_is_someone_to_show/", "over_18": false, "removed_by_category": null}
{"id": "1paqqnv", "subreddit": "lonely_advice", "created_utc": 1764530196, "author": "JPPerdomoOfficial", "title": "Feeling lonely this holiday season? Here’s how to change it for good!", "selftext": "Have the holidays been feeling heavier than usual? You’re not broken. You’re not failing. You’re just human.\n\nThis season triggers loneliness for more people than you think… and I’ve been there too.\n\nToday’s message is a reminder that you’re not stuck with the holidays you had —you can build new ones starting today. Reach out. Reconnect. Honor who you lost. Or open the door to new people and new beginnings.\n\nYou matter more than you think.\n\nIf this message hit you deep, upvote it and hit the reward 🏅button.\n\nYou can also follow me [HERE](http://www.youtube.com/@jpperdomoofficial?sub_confirmation=1) for more inspiration on living with intention and becoming the best version of yourself.\n\n ", "score": 5, "num_comments": 2, "url": "https://v.redd.it/q1zbfdy02g4g1", "permalink": "https://reddit.com/r/lonely_advice/comments/1paqqnv/feeling_lonely_this_holiday_season_heres_how_to/", "over_18": false, "removed_by_category": null}
{"id": "1p9tm5i", "subreddit": "lonely_advice", "created_utc": 1764434983, "author": "CowdingGreenHorn", "title": "One of the hardest things about being lonely is the lack of motivation to do anything since you have no one to share your experiences with", "selftext": "", "score": 2, "num_comments": 0, "url": "https://www.reddit.com/r/lonely_advice/comments/1p9tm5i/one_of_the_hardest_things_about_being_lonely_is/", "permalink": "https://reddit.com/r/lonely_advice/comments/1p9tm5i/one_of_the_hardest_things_about_being_lonely_is/", "over_18": false, "removed_by_category": null}
{"id": "1p8zqhh", "subreddit": "lonely_advice", "created_utc": 1764348724, "author": "CowdingGreenHorn", "title": "The holidays are the happiest time of the year for the average person but full of sadness to lonely people", "selftext": "", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonely_advice/comments/1p8zqhh/the_holidays_are_the_happiest_time_of_the_year/", "permalink": "https://reddit.com/r/lonely_advice/comments/1p8zqhh/the_holidays_are_the_happiest_time_of_the_year/", "over_18": false, "removed_by_category": null}
{"id": "1p56hpc", "subreddit": "lonely_advice", "created_utc": 1763954916, "author": "CowdingGreenHorn", "title": "One of the worst things about being lonely is that you have no one to share your achievements with. It's just you", "selftext": "", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonely_advice/comments/1p56hpc/one_of_the_worst_things_about_being_lonely_is/", "permalink": "https://reddit.com/r/lonely_advice/comments/1p56hpc/one_of_the_worst_things_about_being_lonely_is/", "over_18": false, "removed_by_category": null}
{"id": "1nfh8q2", "subreddit": "lonely_advice", "created_utc": 1757716940, "author": "CowdingGreenHorn", "title": "My life is work then alone in my apartment.", "selftext": "", "score": 3, "num_comments": 0, "url": "/r/lonely/comments/1lt2q3a/my_life_is_work_then_alone_in_my_apartment/", "permalink": "https://reddit.com/r/lonely_advice/comments/1nfh8q2/my_life_is_work_then_alone_in_my_apartment/", "over_18": false, "removed_by_category": null}
{"id": "1nfh85p", "subreddit": "lonely_advice", "created_utc": 1757716900, "author": "CowdingGreenHorn", "title": "Today is my birthday. No one remembered. Not a single person.", "selftext": "", "score": 1, "num_comments": 2, "url": "/r/lonely/comments/1lh6s72/today_is_my_birthday_no_one_remembered_not_a/", "permalink": "https://reddit.com/r/lonely_advice/comments/1nfh85p/today_is_my_birthday_no_one_remembered_not_a/", "over_18": false, "removed_by_category": null}
{"id": "1m84x47", "subreddit": "lonely_advice", "created_utc": 1753364925, "author": "Less-Individual-4171", "title": "I feel like people are forgetting about me", "selftext": "Lately im always hauted by this feeling of lonelyness. I feel like i dont have anyone to talk to about my feelings. Im basically like a shut-in and have no one irl to talk about even talking to my parents feel weird. My lifes just been online same person daily playing games with them over and over again with peple i barely know. Sometimes when i think about it it hits me hard that i got nobody to genuinely hangout with it kinda sucks but i only have one person who i really talk with and that is my gf whom i met online through minecraft. Is there anything i can do to break this cycle?", "score": 3, "num_comments": 1, "url": "https://www.reddit.com/r/lonely_advice/comments/1m84x47/i_feel_like_people_are_forgetting_about_me/", "permalink": "https://reddit.com/r/lonely_advice/comments/1m84x47/i_feel_like_people_are_forgetting_about_me/", "over_18": false, "removed_by_category": null}
{"id": "1l74dlv", "subreddit": "lonely_advice", "created_utc": 1749474553, "author": "alwaysh420", "title": "Advice", "selftext": "I'm 32m suffer from bad social anxiety and overthinking which in turn has made me be alone for the last 7years( struggle to talk to anyone new, especially women) and it's starting to really get to me. Can anyone help me out? ", "score": 2, "num_comments": 0, "url": "https://www.reddit.com/r/lonely_advice/comments/1l74dlv/advice/", "permalink": "https://reddit.com/r/lonely_advice/comments/1l74dlv/advice/", "over_18": false, "removed_by_category": null}
{"id": "1ifsxm1", "subreddit": "lonely_advice", "created_utc": 1738485238, "author": null, "title": "Lonely is my planet", "selftext": "I’m 60(M?). I finally admitted to myself that I am transgender about 8 months ago, but I think I’ve known I’ve been transfem for more than 10 years. I have wanted to be a woman for that long anyway. \n\nI grew up in a strict Catholic family and have recently finished a 44 year career in the Army - hyper masculine profession if there ever was one.\n\nI have been married for 30 years and we have 3 sons in their late 20s. There is no way that my wife would accept that I’m trans and she has significant physical and mental health issues. Two of my sons might accept the real me, if she were to surface. My mother and probably all of my five siblings would not accept me either. I think, however, that almost all of my 11 nieces and nephews would accept me. Minimum one who happens to be transmasc.\n\nNot sure if my assessment that no one would be  accepting of the real me, is me projecting, but I think I’ve thought about it long enough to be pretty much right.\n\nI’m not sure that I will ever be able to come out and be my authentic self. Ever.\n\nWhat’s holding me back? Mostly it’s my wife’s medical condition. If she divorced me, or worse, I would forsake the acceptance of my friends and family, in a nanosecond, to be me.\n\nBut I am pretty much resigned to never being able to be myself, to continue to fake this persona that everyone else knows and likes, for the rest of my life. \n\nAnd in doing so, I am  committing to be utterly alone for whatever length of time I have left in my life, because the real me will never speak to anyone, interact with anyone, or even touch anyone.\n\nThe real me is destined to live inside me for eternity. \n\nI’m not sure that there is anything else I can do, other than grin and bear it. \n\nAll that I guess l can hope from writing this, is that in some minuscule way, it will help to alleviate some of the loneliness I feel to the very centre of my being, every day. But probably not!\n\nThanks for reading this to here. I hope you have a great week!", "score": 5, "num_comments": 0, "url": "https://www.reddit.com/r/lonely_advice/comments/1ifsxm1/lonely_is_my_planet/", "permalink": "https://reddit.com/r/lonely_advice/comments/1ifsxm1/lonely_is_my_planet/", "over_18": false, "removed_by_category": null}
{"id": "1gic2az", "subreddit": "lonely_advice", "created_utc": 1730597944, "author": null, "title": "Is there any solace or relieve of feeling like you wont ever be at peace or alone or feel happy with yourself? advice help", "selftext": "So I wanted to see if I could get advice, since I recently started transitioning into putting focus on hardships, and weaving through goals, diet, and happiness, or have more help/work on myself, for the new year but i’ve been feeling a bit stuck. ;/ for god knows why..... and the longest time I grew up with a few regrets not feeling like I’m enough being stood up or too shy, not going to enough parties etc, which made me think maybe the waiting period is over. I have had more feelings of no care as well as trying to not use these apps or other online sites or distractions, while trying to meditate & be more calm. There are still moments where I feel sad but struggle with personal self worth.\n\nI think the trickiest part of this is going on with life and doing the things you want to do, for me having less time on the internet when i feel empty or sad, i can tell that not surfing continuously is a hurdle i struggle with but i am also very shy. I think looking back i've hit the point in my life where i feel like i've settled with not caring for the constant struggle of waiting for another person to just fall in place. I think the current world that im in makes it harder to be vulnerable within the changes and juggling others lives or trying to be supportive.\n\nMy friends seem to have perfect jobs with their inner circle and I struggle with finding what I want. One of my close friends just had a baby has been making me miserable, we used to be close i’ve been trying to cope with the stress by ignoring i texted him how i feel and he doesn’t seem to care i swear we were close but idk what to do. It has taught me to try to meditate more and not rely on others.\n\ni've also given up on any quote \"real\" connection given the amount of time i've been ghosted reaching out using apps something i should've seen the signs for years prior. Its been helpful since i don't feel like I have a burden to carry staying away from these apps. I don't really know how to react mostly when i reach out & try to be nice or feel like my friends have become focused on their lives, although I have one friend who reaches out and we text. I would like to have more friends who will call at the drop of a hat.... or someone who's there for you 24/7.\n\nThere are a lot of things that take effort these things do not easily come together immediately, patience is another thing that a lot of single people struggle with. There are things we try to do every day from the moment we wake up to brushing our teeth i think the hardest part is finally taking initiative and saying maybe you wont find someone and that will be ok. ¯\\\\\\_(ツ)\\_/¯ Whats healthy & whats not can be subjective & hard to track down which one we need.\n\nLoneliness can be hard when you dont have the tools to equip or juggle it or find your peace being alone if you have friends who can help you it can be helpful, so I wonder is finding peace & accepting that one is not looking for committing to a date or telling yourself I need to find out what my needs are first before jumping head on into anything if at all. I think healing and learning you who are as a person is hard as well.\n\nJust curious what people think or if they want to share similar experiences on this. Thanks!!", "score": 5, "num_comments": 2, "url": "https://www.reddit.com/r/lonely_advice/comments/1gic2az/is_there_any_solace_or_relieve_of_feeling_like/", "permalink": "https://reddit.com/r/lonely_advice/comments/1gic2az/is_there_any_solace_or_relieve_of_feeling_like/", "over_18": false, "removed_by_category": null}
{"id": "1g50ebt", "subreddit": "lonely_advice", "created_utc": 1729088081, "author": "kgiann2021", "title": "Hello to the group! Where are you all from? ", "selftext": "", "score": 7, "num_comments": 8, "url": "https://www.reddit.com/r/lonely_advice/comments/1g50ebt/hello_to_the_group_where_are_you_all_from/", "permalink": "https://reddit.com/r/lonely_advice/comments/1g50ebt/hello_to_the_group_where_are_you_all_from/", "over_18": false, "removed_by_category": null}
{"id": "1fvs1zn", "subreddit": "lonely_advice", "created_utc": 1728020315, "author": "CowdingGreenHorn", "title": "It’s okay if you want attention 💛", "selftext": "", "score": 8, "num_comments": 0, "url": "/r/lonely/comments/1fgtcvl/its_okay_if_you_want_attention/", "permalink": "https://reddit.com/r/lonely_advice/comments/1fvs1zn/its_okay_if_you_want_attention/", "over_18": false, "removed_by_category": null}
{"id": "1eko2bq", "subreddit": "lonely_advice", "created_utc": 1722865240, "author": "vinaylovestotravel", "title": "This $99, AI-Powered Necklace For 'Lonely People' Is Changing The Way We View Wearable Tech", "selftext": "", "score": 3, "num_comments": 0, "url": "https://www.ibtimes.co.uk/this-99-ai-powered-necklace-lonely-people-changing-way-we-view-wearable-tech-1726001", "permalink": "https://reddit.com/r/lonely_advice/comments/1eko2bq/this_99_aipowered_necklace_for_lonely_people_is/", "over_18": false, "removed_by_category": null}
{"id": "1c8hl0o", "subreddit": "lonely_advice", "created_utc": 1713588701, "author": "BigHarlem1918", "title": "The shit end of a shit stick ", "selftext": "So I'm trying to not let this ruin my weekend. Thursday at work (I'm an elementary school janitor) someone texted my boss that I was sitting asleep.... I wasn't.... My head was pounding and I was trying to function.... I didn't call out cause we're already down 2 people from the crew.... My boss texted \"we'll discuss this matter Monday\".... But I know he doesn't believe me.... Also I'm sad that someone would immediately text him and try and get me in trouble and not think that something was wrong cause I'm a good reliable employee yet they couldn't even check on me before trying to be a rat....So Friday I wake up and I'm immediately getting sick (exactly what you think I just don't want to type it) and when I go to take my lil step dude to school I had to open the door and barf all over the parking lot.... Obviously I can't clean a school like that.... I call and text my boss with no response so I follow protocol and call my principal.... She was extremely nice and understanding and didn't want me to come to work like that.... But now at 1am Saturday morning I'm second guessing my decision to stay home.... Either way they'd have been mad.... If I spent the whole shift in the bathroom at work or at home either way I'm not getting work done... But I feel like I've set myself up for an even bigger ass chewing come Monday.... I'm hoping I don't let this ruin my weekend ", "score": 8, "num_comments": 7, "url": "https://www.reddit.com/r/lonely_advice/comments/1c8hl0o/the_shit_end_of_a_shit_stick/", "permalink": "https://reddit.com/r/lonely_advice/comments/1c8hl0o/the_shit_end_of_a_shit_stick/", "over_18": false, "removed_by_category": null}
{"id": "1bujlpr", "subreddit": "lonely_advice", "created_utc": 1712118168, "author": "CowdingGreenHorn", "title": "Are you lonely?", "selftext": "Our world has never been as connected as it is right now. We can talk to someone on the other side of the planet in a matter of seconds, and yet we often feel alone in our lives. It is a pandemic of loneliness. Billions of people are suffering every day, and yet no one seems to care.  I have personally suffered with loneliness through much of my life and experienced what it's like to go through a mental hell with no one to offer a helping. This is why I created this subreddit.   \n\n\nSo, if you are struggling with loneliness, do not be afraid to reach out to this subreddit for help. If you just want to vent your frustrations related to loneliness, then that's okay too.", "score": 18, "num_comments": 0, "url": "https://www.reddit.com/r/lonely_advice/comments/1bujlpr/are_you_lonely/", "permalink": "https://reddit.com/r/lonely_advice/comments/1bujlpr/are_you_lonely/", "over_18": false, "removed_by_category": null}
{"id": "1bnktrq", "subreddit": "lonely_advice", "created_utc": 1711391001, "author": "Valerie100000000000", "title": "Any advice?", "selftext": "I am so very lonely and depressed. Wow. I want to make new friends but not sure how. I just want to meet nice people.", "score": 6, "num_comments": 3, "url": "https://www.reddit.com/r/lonely_advice/comments/1bnktrq/any_advice/", "permalink": "https://reddit.com/r/lonely_advice/comments/1bnktrq/any_advice/", "over_18": false, "removed_by_category": null}
{"id": "199yehe", "subreddit": "lonely_advice", "created_utc": 1705606024, "author": "CowdingGreenHorn", "title": "Does anyone miss the old internet?", "selftext": "", "score": 5, "num_comments": 1, "url": "/r/lonely/comments/18u45k3/does_anyone_miss_the_old_internet/", "permalink": "https://reddit.com/r/lonely_advice/comments/199yehe/does_anyone_miss_the_old_internet/", "over_18": false, "removed_by_category": null}
{"id": "1922pyt", "subreddit": "lonely_advice", "created_utc": 1704765009, "author": "Gustavo1519", "title": "What hobbies distract you from being lonely?", "selftext": "", "score": 1, "num_comments": 2, "url": "/r/lonely/comments/191rvbh/what_hobbies_distract_you_from_being_lonely/", "permalink": "https://reddit.com/r/lonely_advice/comments/1922pyt/what_hobbies_distract_you_from_being_lonely/", "over_18": false, "removed_by_category": null}
{"id": "191wc19", "subreddit": "lonely_advice", "created_utc": 1704748689, "author": "robadean", "title": "21 not so fun", "selftext": "So I'm turning 21 next week. I recently moved to a new state and I really don't know anyone. My family are all in another state. I have a few work acquaintances but I'm not super close to anyone. I don't know what to do or if I even should do anything. Maybe just go out for a drink and go home? It just seems kind of depressing but I'm not sure what else there is to really do. Any suggestions or advice would be appreciated!", "score": 7, "num_comments": 5, "url": "https://www.reddit.com/r/lonely_advice/comments/191wc19/21_not_so_fun/", "permalink": "https://reddit.com/r/lonely_advice/comments/191wc19/21_not_so_fun/", "over_18": false, "removed_by_category": null}
{"id": "18k6bxy", "subreddit": "lonely_advice", "created_utc": 1702777705, "author": "CowdingGreenHorn", "title": "Since how long you are lonely/single and what is your age? How do you guys enjoy life daily?", "selftext": "", "score": 5, "num_comments": 3, "url": "/r/lonely/comments/18fubc2/since_how_long_you_are_lonelysingle_and_what_is/", "permalink": "https://reddit.com/r/lonely_advice/comments/18k6bxy/since_how_long_you_are_lonelysingle_and_what_is/", "over_18": false, "removed_by_category": null}
{"id": "182fvq6", "subreddit": "lonely_advice", "created_utc": 1700788154, "author": "CowdingGreenHorn", "title": "does anyone else fall in love with anybody who shows them the slightest bit of affection ?", "selftext": "", "score": 6, "num_comments": 2, "url": "/r/lonely/comments/17uzm7c/does_anyone_else_fall_in_love_with_anybody_who/", "permalink": "https://reddit.com/r/lonely_advice/comments/182fvq6/does_anyone_else_fall_in_love_with_anybody_who/", "over_18": false, "removed_by_category": null}
{"id": "182fvet", "subreddit": "lonely_advice", "created_utc": 1700788123, "author": "CowdingGreenHorn", "title": "Anyone else genuinely have NO FRIENDS", "selftext": "", "score": 9, "num_comments": 2, "url": "/r/lonely/comments/17idm7m/anyone_else_genuinely_have_no_friends/", "permalink": "https://reddit.com/r/lonely_advice/comments/182fvet/anyone_else_genuinely_have_no_friends/", "over_18": false, "removed_by_category": null}
{"id": "17y3f4r", "subreddit": "lonely_advice", "created_utc": 1700302201, "author": "CowdingGreenHorn", "title": "does anyone else fall in love with anybody who shows them the slightest bit of affection ?", "selftext": "", "score": 3, "num_comments": 1, "url": "/r/lonely/comments/17uzm7c/does_anyone_else_fall_in_love_with_anybody_who/", "permalink": "https://reddit.com/r/lonely_advice/comments/17y3f4r/does_anyone_else_fall_in_love_with_anybody_who/", "over_18": false, "removed_by_category": null}
{"id": "17sd1pt", "subreddit": "lonely_advice", "created_utc": 1699648258, "author": "CowdingGreenHorn", "title": "Have you thought about what would happen if your crush liked you too?", "selftext": "", "score": 2, "num_comments": 0, "url": "/r/Crushes/comments/17s4dx5/have_you_thought_about_what_would_happen_if_your/", "permalink": "https://reddit.com/r/lonely_advice/comments/17sd1pt/have_you_thought_about_what_would_happen_if_your/", "over_18": false, "removed_by_category": null}
{"id": "17sd1dr", "subreddit": "lonely_advice", "created_utc": 1699648230, "author": "CowdingGreenHorn", "title": "Do you find your own family are giving up on you?", "selftext": "", "score": 4, "num_comments": 1, "url": "/r/ForeverAlone/comments/17s9bqi/do_you_find_your_own_family_are_giving_up_on_you/", "permalink": "https://reddit.com/r/lonely_advice/comments/17sd1dr/do_you_find_your_own_family_are_giving_up_on_you/", "over_18": false, "removed_by_category": null}
{"id": "17qnqpj", "subreddit": "lonely_advice", "created_utc": 1699456369, "author": "CowdingGreenHorn", "title": "I deleted Instagram", "selftext": "", "score": 1, "num_comments": 0, "url": "/r/lonely/comments/17h1u5w/i_deleted_instagram/", "permalink": "https://reddit.com/r/lonely_advice/comments/17qnqpj/i_deleted_instagram/", "over_18": false, "removed_by_category": null}
{"id": "17qnoub", "subreddit": "lonely_advice", "created_utc": 1699456223, "author": "CowdingGreenHorn", "title": "(F18) i turned 18 today and I’m celebrating my birthday alone….again.", "selftext": "", "score": 4, "num_comments": 3, "url": "/r/lonely/comments/17pvg3i/f18_i_turned_18_today_and_im_celebrating_my/", "permalink": "https://reddit.com/r/lonely_advice/comments/17qnoub/f18_i_turned_18_today_and_im_celebrating_my/", "over_18": false, "removed_by_category": null}
{"id": "17l30n3", "subreddit": "lonely_advice", "created_utc": 1698808540, "author": "CowdingGreenHorn", "title": "Is there anything more frustrating than \"you need to love yourself before you find love\"?", "selftext": "", "score": 3, "num_comments": 0, "url": "/r/lonely/comments/17gk8wy/is_there_anything_more_frustrating_than_you_need/", "permalink": "https://reddit.com/r/lonely_advice/comments/17l30n3/is_there_anything_more_frustrating_than_you_need/", "over_18": false, "removed_by_category": null}
{"id": "17l30h4", "subreddit": "lonely_advice", "created_utc": 1698808528, "author": "CowdingGreenHorn", "title": "Anyone else genuinely have NO FRIENDS", "selftext": "", "score": 3, "num_comments": 1, "url": "/r/lonely/comments/17idm7m/anyone_else_genuinely_have_no_friends/", "permalink": "https://reddit.com/r/lonely_advice/comments/17l30h4/anyone_else_genuinely_have_no_friends/", "over_18": false, "removed_by_category": null}
{"id": "17i10c5", "subreddit": "lonely_advice", "created_utc": 1698450599, "author": "CowdingGreenHorn", "title": "Is there anything more frustrating than \"you need to love yourself before you find love\"?", "selftext": "", "score": 2, "num_comments": 3, "url": "/r/lonely/comments/17gk8wy/is_there_anything_more_frustrating_than_you_need/", "permalink": "https://reddit.com/r/lonely_advice/comments/17i10c5/is_there_anything_more_frustrating_than_you_need/", "over_18": false, "removed_by_category": null}
{"id": "17ahyq6", "subreddit": "lonely_advice", "created_utc": 1697602834, "author": "CowdingGreenHorn", "title": "I am 31(F) with no life/friends.. please tell me I’m not the only one.", "selftext": "", "score": 3, "num_comments": 4, "url": "/r/lonely/comments/178pnh3/i_am_31f_with_no_lifefriends_please_tell_me_im/", "permalink": "https://reddit.com/r/lonely_advice/comments/17ahyq6/i_am_31f_with_no_lifefriends_please_tell_me_im/", "over_18": false, "removed_by_category": null}
{"id": "174ycvx", "subreddit": "lonely_advice", "created_utc": 1696977528, "author": "CowdingGreenHorn", "title": "Happy World Mental Health Day!", "selftext": ":)", "score": 2, "num_comments": 0, "url": "https://www.reddit.com/r/lonely_advice/comments/174ycvx/happy_world_mental_health_day/", "permalink": "https://reddit.com/r/lonely_advice/comments/174ycvx/happy_world_mental_health_day/", "over_18": false, "removed_by_category": null}
{"id": "16wg3j7", "subreddit": "lonely_advice", "created_utc": 1696103551, "author": "CowdingGreenHorn", "title": "What do you do to distract yourself from loneliness?", "selftext": "", "score": 1, "num_comments": 0, "url": "/r/lonely/comments/16vfs65/what_do_you_do_to_distract_yourself_from/", "permalink": "https://reddit.com/r/lonely_advice/comments/16wg3j7/what_do_you_do_to_distract_yourself_from/", "over_18": false, "removed_by_category": null}
{"id": "16wg3bz", "subreddit": "lonely_advice", "created_utc": 1696103534, "author": "CowdingGreenHorn", "title": "im very touched starved", "selftext": "", "score": 3, "num_comments": 0, "url": "/r/lonely/comments/16sg88s/im_very_touched_starved/", "permalink": "https://reddit.com/r/lonely_advice/comments/16wg3bz/im_very_touched_starved/", "over_18": true, "removed_by_category": null}
{"id": "16oxzae", "subreddit": "lonely_advice", "created_utc": 1695347713, "author": "CowdingGreenHorn", "title": "Have you ever thought that you are an invisible person?", "selftext": "", "score": 3, "num_comments": 0, "url": "/r/lonely/comments/16kyoty/have_you_ever_thought_that_you_are_an_invisible/", "permalink": "https://reddit.com/r/lonely_advice/comments/16oxzae/have_you_ever_thought_that_you_are_an_invisible/", "over_18": false, "removed_by_category": null}
{"id": "16452wz", "subreddit": "lonely_advice", "created_utc": 1693273915, "author": "CowdingGreenHorn", "title": "How many people have 0 friends?", "selftext": "", "score": 2, "num_comments": 1, "url": "/r/lonely/comments/160ulvf/how_many_people_have_0_friends/", "permalink": "https://reddit.com/r/lonely_advice/comments/16452wz/how_many_people_have_0_friends/", "over_18": false, "removed_by_category": null}
{"id": "15m2e0q", "subreddit": "lonely_advice", "created_utc": 1691548469, "author": "CowdingGreenHorn", "title": "You ever notice the kindest people are the most lonely?", "selftext": "", "score": 3, "num_comments": 0, "url": "/r/lonely/comments/15iqoqh/you_ever_notice_the_kindest_people_are_the_most/", "permalink": "https://reddit.com/r/lonely_advice/comments/15m2e0q/you_ever_notice_the_kindest_people_are_the_most/", "over_18": false, "removed_by_category": null}
{"id": "15epeqz", "subreddit": "lonely_advice", "created_utc": 1690831442, "author": "Gooch_18", "title": "jUsT bE YoUrSeLF!", "selftext": "for anyone struggling", "score": 3, "num_comments": 0, "url": "https://youtu.be/FpfO0GuflgY", "permalink": "https://reddit.com/r/lonely_advice/comments/15epeqz/just_be_yourself/", "over_18": false, "removed_by_category": null}
{"id": "1522fxx", "subreddit": "lonely_advice", "created_utc": 1689601579, "author": "CowdingGreenHorn", "title": "My heart is broken…", "selftext": "", "score": 1, "num_comments": 0, "url": "/r/lonely/comments/14bs28h/my_heart_is_broken/", "permalink": "https://reddit.com/r/lonely_advice/comments/1522fxx/my_heart_is_broken/", "over_18": false, "removed_by_category": null}
{"id": "14rtlnx", "subreddit": "lonely_advice", "created_utc": 1688606263, "author": "CowdingGreenHorn", "title": "I am so lonely that I smile after seeing someone upvoted me!", "selftext": "", "score": 1, "num_comments": 0, "url": "/r/lonely/comments/jwh0zt/i_am_so_lonely_that_i_smile_after_seeing_someone/", "permalink": "https://reddit.com/r/lonely_advice/comments/14rtlnx/i_am_so_lonely_that_i_smile_after_seeing_someone/", "over_18": false, "removed_by_category": null}
