{"id": "1kx0rzn", "subreddit": "lonelinesssupport", "created_utc": 1748384703, "author": null, "title": "Why?", "selftext": "Lately, I’ve been asking myself—why does it feel like nobody wants anything to do with me? I know I have my quirks, but I’m not awkward or weird. I’m confident in who I am, and I know I’ve got good qualities.\n\nSince my wife left, everything’s felt different. It’s like the world just kind of… pulled back. I try to stay strong and keep my head up, but honestly, I’m struggling. I want to connect with people—to have real friends again, someone to talk to, maybe even build something romantic again.\n\nI don’t want this loneliness to define me or break me. I’m doing the best I can, but sometimes it’s just hard to understand why it feels like I’m invisible. If you’ve ever felt like this, or if you’re open to connecting, just know—I’m here, and I’d really appreciate a conversation. 32/ M4F Louisville, ky", "score": 8, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1kx0rzn/why/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1kx0rzn/why/", "over_18": false, "removed_by_category": null}
{"id": "1kv6s4x", "subreddit": "lonelinesssupport", "created_utc": 1748190874, "author": "Sonia_K_Woods", "title": "A social network for lonely people", "selftext": "Hey everyone, I wanted to share something I’ve been working on—[BondBridge](https://www.bondbridge.online/signup?referral=1VF1NK). It’s an AI-powered platform designed to help people connect in a more meaningful way, especially for those who feel isolated or struggle with social anxiety.\n\nI noticed how disconnected a lot of people feel, even with social media, and wanted to create a space where people could form real friendships without the pressure or awkwardness. The AI matches you with others who share similar vibes and interests, and you can chat privately, securely, or anonymously if that’s more comfortable.\n\nI’m really proud of how it’s helping people build connections in a time when loneliness is such a big issue. The browser version is up now, and the mobile app will be available soon. If you’re looking to meet people and make real connections, feel free to check it out. It is, and will be, completely free.\n\n[Here](https://bondbridge.ai/) you can find more information and explanations about our goal and [here](https://www.bondbridge.online/signup?referral=1VF1NK) is the browser version.", "score": 5, "num_comments": 2, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1kv6s4x/a_social_network_for_lonely_people/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1kv6s4x/a_social_network_for_lonely_people/", "over_18": false, "removed_by_category": null}
{"id": "1k9c1z9", "subreddit": "lonelinesssupport", "created_utc": 1745781636, "author": "Accurate_Lake2199", "title": "Struggling during medical treatment. Loss of friends.", "selftext": "I recently suffered a CVA and got diagnosed a Brain tumor , got into a whole lot of medical treatments. Chemo and radiotherapy. It took a bit of a toll on me mentally and emotionally. I was reaching out for my best friend and venting a lot to her with what I was going through. And she told me one day that she didn't want to hear it because it was a lot to her or something. But I needed a friend that'd listen to me in those hard moments I was going through. I ended up blocking her. A bit out of disbelief that my best friend couldn't or didn't want to support me in a moment like this. Now I feel lonelier than ever. Because I don't have that many friends. Maybe some online but it's hard making valuable connections. I kinda want the real thing. I also lost my boyfriend during this time which made things so much difficult as well.\n\nAnyway, how are you coping with loneliness?", "score": 1, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1k9c1z9/struggling_during_medical_treatment_loss_of/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1k9c1z9/struggling_during_medical_treatment_loss_of/", "over_18": false, "removed_by_category": null}
{"id": "1k4ddds", "subreddit": "lonelinesssupport", "created_utc": 1745241674, "author": "lightskinjay7736", "title": "My tips on dealing with loneliness", "selftext": "The past 4 to 5 years I've been pretty lonely for a variety of reasons, but i found that embracing the small bits of genuinely good social interactions has helped a lot. Even though I don't talk to friends that much or hang out with them at all, I find that when I focus on those more than the times when nobody is there, it makes coping a little easier. Also, just finding things to do alone that make you happy can help. There are times where the loneliness gets to me, but compared to 6 months ago I'm able to cope with it a lot more now and that had led to me being more confident and more willing to put myself out there. Also, don't be afraid to go out there and find new friends. I know cutting off old ones who really aren't there can be difficult and I know putting yourself out there and making yourself vulnerable to rejection is extremely hard as well. But rejection and inaction both lead to loneliness. There are billions of people on this planet and we are only exposed to a very minute amount of them in our personal lives. Don't find hobbies with the sole purpose of meeting friends or for relationships, find hobbies that even if nobody else wants to join you, that you can enjoy yourself. The mindset switch is not an overnight process and it's taken me a long time to deal with and it's difficult to maintain at times and it won't cure loneliness but it will go a long way with coping ", "score": 5, "num_comments": 6, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1k4ddds/my_tips_on_dealing_with_loneliness/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1k4ddds/my_tips_on_dealing_with_loneliness/", "over_18": false, "removed_by_category": null}
{"id": "1k48efq", "subreddit": "lonelinesssupport", "created_utc": 1745223592, "author": "agoverningfrost", "title": "Hi", "selftext": "I never really had issues making friends in high school and uni. Nor do I consider myself to be shy. But now in my adulthood, I just…struggle to connect. I’m 30 and have no one. I used to have a bunch of online friendships, like real fucking deep connections. They’re all gone now. Even though I’m astonishingly self-critical, with therapy I’ve come to realize I’m not to blame. In fact, most of these falling outs were not set off by me. But it doesn’t mean I’m not hurt. \n\nAnyway, I live with my folks, and I’m doing what I can to open a coffee shop at home soon. \nDo I have a horrible life? Not really. I’d go as far as to call it privileged in some ways. Yet something in me is broken. Something beyond explanation.\n\nI’m in so much pain every second of the day, with no end in sight. I don’t understand why the love I gave amounted to nothing. If friendship, affection, support, and love, are the most important things in life, then how can people so easily dismiss it? How are people cold enough to ghost someone they’ve known for years? \nI’m writing all of this not for sympathy, not for pity, not to fish for cliches about the value of life. It’s merely to show you none of this really matters. You can go through life wrecking everyone and still come out unscathed. You can take away someone’s dignity, make them feel unworthy for the rest of their lives, and face no consequences. The loving ones take the toll.", "score": 3, "num_comments": 6, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1k48efq/hi/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1k48efq/hi/", "over_18": false, "removed_by_category": null}
{"id": "1k3g81r", "subreddit": "lonelinesssupport", "created_utc": 1745130002, "author": "dior_prada_cuggi", "title": "I have a lot of people around me but I still feel lonely", "selftext": "I want someone to love me unconditionally. Someone who cares about what goes on in my mind. Who will check up on me every hour of the day. Who will take care of me. Who will want to understand me. Who will listen to me. Why is it so easy for other people to find love? But it is so hard for me? Is there something wrong with me? ", "score": 2, "num_comments": 5, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1k3g81r/i_have_a_lot_of_people_around_me_but_i_still_feel/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1k3g81r/i_have_a_lot_of_people_around_me_but_i_still_feel/", "over_18": false, "removed_by_category": null}
{"id": "1jjgnll", "subreddit": "lonelinesssupport", "created_utc": 1742900283, "author": "48janevtrust", "title": "anyone else feeling extremely lonely", "selftext": "", "score": 3, "num_comments": 2, "url": "/r/mentalhealth/comments/1ii855q/anyone_else_feeling_extremely_lonely/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1jjgnll/anyone_else_feeling_extremely_lonely/", "over_18": false, "removed_by_category": null}
{"id": "1jf5qt0", "subreddit": "lonelinesssupport", "created_utc": 1742413246, "author": "Federal_Key5261", "title": "Hey dude, straighten your tie!", "selftext": "Hi guys.\nSince childhood, I have developed a rule of courtesy: \"If someone has a problem that can be fixed in 30 seconds, remind them of it immediately. If it will take them some time to resolve, leave it; let others peoples around them point it out. If they live with the same problem for a very long time, it means they have no one to warn them. If they have people around them, encourage those people; if not, alert them yourself with utmost politeness. If they can never solve their problem, always ignore it, pretend it doesn't exist, and take opportunities to cover for their shortcoming without making them feel it.\"\n\nSo guys,\nwhilst I occasionally stray from that final point, I have always been terribly attentive to the others and have been rather fond of people who exhibit similar behaviour. For it's patently obvious that being considerate is a splendid virtue. As I've grown older, I've realised that when you are alone(but truly alone) there's no one to straighten your crooked tie. Sometimes in windy weather, a leaf, insect or dust might land on your jacket, or heaven forbid, a bird might relieve itself on your back, and even if you spend hours in an important place, you'll notice this flaw far too late. Bingo! You're in that magnificent moment of emotional fracture and crisis. Do remain calm and attempt to control what follows... First, you'll berate yourself, growing cross at your own carelessness, furious for having spent yet another day without proper self-awareness. From this point, try to conclude that since no one mentioned it, the flaw must be an insignificant detail, and endeavour to forget it. Should you fail in this, you'll begin to pity yourself, as the realisation dawns that in that gathering of people you cherished and believed you had a lovely time with, not a soul warned you, reminding you of your utterly wretched state. This stage is exceedingly painful and may lead to devastation you could never have predicted. Nevertheless, it's still not too late to forget and disregard what transpired. The moment when the camel's back breaks, as it were, is when you begin making foolish comparisons like, \"But I always warn them, why does no one warn me?\" You simply cannot use today's invoices for the small kindnesses (I prefer to call them touches) you performed yesterday without expectation of reciprocation, as this creates an outright moral contradiction. When this entire tumultuous process ends with minimal damage, you've broken through the stratosphere, so to speak.  You will have added a new moment to your List of Times and Places Where You Remained Unresponsive: when you notice and fix your own crooked tie, pretend not to notice. Just as you do (or at least attempt to do) with others, \"If they can never solve their problem, always ignore it, pretend it doesn't exist, and take opportunities to cover for their shortcoming without making them feel it.\"\n\nSo guys,\nwwho are the people who can never solve their problems? The disabled. Those whom society calls disabled are people who can never solve their problem alone. Therefore, if you're alone(I mean, clearly alone in every sense of the word) this likely makes you a disabled person. But it doesn't matter, let it go\nand  now, straighten your tie.", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1jf5qt0/hey_dude_straighten_your_tie/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1jf5qt0/hey_dude_straighten_your_tie/", "over_18": false, "removed_by_category": null}
{"id": "1j6oom1", "subreddit": "lonelinesssupport", "created_utc": 1741461708, "author": "NamedPurity", "title": "Loneliness: that toxic situationship you can’t ghost", "selftext": "", "score": 3, "num_comments": 0, "url": "https://open.spotify.com/episode/3xMKQbaI7Ztqep6C7cM6AF?si=PY5ujqAhR3eWpn3XPaFj1Q&context=spotify%3Ashow%3A6vVAdnfbvuIpIf9wDqlMxQ", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1j6oom1/loneliness_that_toxic_situationship_you_cant_ghost/", "over_18": false, "removed_by_category": null}
{"id": "1iecjz4", "subreddit": "lonelinesssupport", "created_utc": 1738322331, "author": "Abz_D", "title": "Discord Group", "selftext": "I am part of a Discord Group and we're looking for new friends to be part of our cohort. We're looking for compassionate, 18+ people who make our discussions lively and fun. So please DM me for details and I'll let the admin know your username.\n\nLooking forward to getting to know you guys 🙂", "score": 6, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1iecjz4/discord_group/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1iecjz4/discord_group/", "over_18": false, "removed_by_category": null}
{"id": "1i3dqvf", "subreddit": "lonelinesssupport", "created_utc": 1737111017, "author": "Alternative-Wolf-171", "title": "I feel so sad that no one understands the pain of loneliness and how much it can hold you back.", "selftext": "I have spent most of my life in complete and utter loneliness. I had emotionaly abusive and absolutely emotionally neglectful parents to the point that I felt completely invisible. Had close to no friemds most of my life as I am autistic. Had to go through all the hard times on my own and had zero support as a child. I made my first good friend when i was 21 and now he lives in another city.\n\nIt annoys me that i cant ask for support and people assume my life is easy or fun. I feel like i am left with no choice, i cant complaim because things are not bad enough. And i cant feel seen because i have to pretend life is great because people act like i am just not supposed to feel that way regardless of circumstances.", "score": 8, "num_comments": 5, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1i3dqvf/i_feel_so_sad_that_no_one_understands_the_pain_of/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1i3dqvf/i_feel_so_sad_that_no_one_understands_the_pain_of/", "over_18": false, "removed_by_category": null}
{"id": "1i0qy8s", "subreddit": "lonelinesssupport", "created_utc": 1736808253, "author": "Glass_Bad5138", "title": "HELP:Loneliness, weight gain, depression, social anxiety, covid, friendless, and nostalgic for times past. ", "selftext": "I'm 30(F), INTJ-T if that matters. The past few years I've started experiencing reminiscing episodes about my high-school and 20s years. They start so happy then turn to painful nostalgia. It can get triggered by listening to the first ten seconds of a song. Very difficult to avoid triggers. \nSome context:I used to be social, then after lock down and four cases of covid I developed bad social anxiety. It seems I've lost all my friends, and it seems like everyone I used to know are flourishing, moving forward in their lives. It doesn't help that I tend to hoard memories of happy times. It's not a conscious decision. \n\nI really want to overcome the anxiety and try salvage old friendships. Unfortunately, I don't live in the same city as many of them anymore. So, meeting new people and such would be ideal. I really want to overcome the social anxiety. \n\nMaybe worth mentioning, I live in South Africa, I struggle with depression and anxiety in general, I study full-time online (ironically to become a counsellor) with almost no contact sessions. I also got bad burnout in November and December. \nLastly, I've gained quite a bit of weight, which really affects my self esteem. However, it has definitely made me more sympathetic to others who also struggle with overeating. \n\nAlcohol used to make me social and feel comfortable and fun around people. I stopped drinking a few years ago because it messed with my antidepressant sporadically, I could never manage it in such a way that I could prevent embarrassing drunkeness and such. Also, alcoholism in the family is scary to me, I'm scared I might start the night with one drink and end up drinking way too much like I used to. Lowered inhibitions have negatively affected my life in the past, and I'm a more devout Christian now.\n\nThe intense loneliness and nostalgia is physically painful. \nANY advice is greatly appreciated!", "score": 3, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1i0qy8s/helploneliness_weight_gain_depression_social/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1i0qy8s/helploneliness_weight_gain_depression_social/", "over_18": false, "removed_by_category": null}
{"id": "1hftffe", "subreddit": "lonelinesssupport", "created_utc": 1734382845, "author": "f____society", "title": "I feel so lonely and just looking for someone to talk to.", "selftext": "That's all. If anyone interested, can we pm?", "score": 5, "num_comments": 3, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1hftffe/i_feel_so_lonely_and_just_looking_for_someone_to/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1hftffe/i_feel_so_lonely_and_just_looking_for_someone_to/", "over_18": false, "removed_by_category": null}
{"id": "1h70cop", "subreddit": "lonelinesssupport", "created_utc": 1733371363, "author": "Bbbbbeeeeeee", "title": "Looking for people to be part of the free trial? ", "selftext": "Hello ☺️ I am at the beginning stages of starting a project to bring daily connection and light to the people who need it most. \n\nLoneliness is something so many people suffer with and the thought of people being out there not having someone check on them at least once a week breaks my heart. Connection and community is a basic need for human survival.\n\nI have gone through some pretty low and lonely times myself, not having someone reliable or someone to turn to. I can now say I am truely blessed with some incredible people in my life and honestly every day I count my lucky stars for each and every one of them. \n\nEveryone deserves connection, everyone deserves to be seen, everyone deserves to feel like someone cares. \n\nI have a 3 minute survey I’d love if people could fill out, wanting to get as much in for possible do I can give back where it’s truely needed, and if you would like to participate in the a free trial you can leave your details at the end of the survey. \n\nhttps://forms.gle/fqvA5cUG8N1a1oSN7 \n\nif you’d like to follow along the journey, you can find me on instagram until I get everything else up and running. \n\nThanks for your time and please if you can share ", "score": 0, "num_comments": 0, "url": "https://forms.gle/fqvA5cUG8N1a1oSN7", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1h70cop/looking_for_people_to_be_part_of_the_free_trial/", "over_18": false, "removed_by_category": null}
{"id": "1h69rua", "subreddit": "lonelinesssupport", "created_utc": 1733293797, "author": "Simbakshi", "title": "Online Mental Health Circle on Grief [This is a free to attend event]\n", "selftext": "Hi everyone,  \nI'm back at hosting another Circle - this time the theme is Grief. We're planning this for 12th Dec, Thursday 7:30 pm so that more folks can join in post work and it does not collide with weekend plans or work.\n\nHow it works:\n\n* We typically start out with some basic group guidelines laying down confidentiality and rules that help us maintain a safe space (no interruptions)\n* We go around the group where everyone gets a chance to share their struggles, thoughts, experience on grief.\n\nHow this helps:\n\n* It gives you a group of strangers to connect to who might have experienced similar situations - making it easier to talk\n* It opens you up and enables you to talk about your struggles - breaking mental health taboo\n\nIf you're interested in attending, please sign up here: [https://tally.so/r/mKoR57](https://tally.so/r/mKoR57) \\[This is a free to attend event\\]", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1h69rua/online_mental_health_circle_on_grief_this_is_a/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1h69rua/online_mental_health_circle_on_grief_this_is_a/", "over_18": false, "removed_by_category": null}
{"id": "1h5x3pz", "subreddit": "lonelinesssupport", "created_utc": 1733257339, "author": "MrKafkaesque369", "title": "Loneliness ", "selftext": "Gen Z loneliness among indians.... What do you say?? ", "score": 2, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1h5x3pz/loneliness/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1h5x3pz/loneliness/", "over_18": false, "removed_by_category": null}
{"id": "1gifv6f", "subreddit": "lonelinesssupport", "created_utc": 1730611190, "author": "Smooth-Flight-8716", "title": "Hi, I’m not feeling too great", "selftext": "I'll start by saying I'm a teen, and that I know they normally get angsty and depressed. However I'm just so lost right now. I don't feel motivation. I don't laugh. I want to feel like a loser. I don't know it's just easier that way. My studying is going down the drain despite me going to a very well middle school where I learned a lot. I got all A's all my life. Then I went to a public high school and learned just how big this world is. It's all too much. I feel like no one. I just adapted to whatever and now I'm nothing. I have so many dumb skills and hobbies, I mean ask me. You wouldn't even believe how much I've done. Seriously. Just searching. But I know I just want a story to telll others. Like here. I learned my crush is a bad guy, I learned I just sway to everyone's personality. I learned I needed values. But I also learned that values is what gets you out. My head hurts all the time. I'm tired. I'm tired of the education they are feeding me. I'm tired of not being able to marry someone already and live in a home. I'm tired. I don't care anymore. I am so behind on everything and honestly I love it. I'm tired of being so oddamn perfect all the time. I want to fight someone and do something stupid. Oh maybe just become a rebellious teen. Well no, the other side of my head strictly forbids it. It's all too much. I'm tired. I just wanna go home but I'm already home. I went to a party which was very nice but all I can do is complain. My friends at school are fake. My crush doesn't like me anymore. He's friends with this guy I hated. I can't think anymore. I can't live. I just wish everything was easy. Why can't it be safe. Why am I blessed with this stupid knowledge that you are you're own person and why was I blessed with such a sheltered life to make everything else in the world seem oh so much harder. I'm tired. I can't even talk to people without feeling like I'm about to die. It's probably some sort of trauma from being forced in a small school to sit alone of the grass for a year after no one liked me. Or maybe my parents not caring. Or maybe I was always fine. If I was always fine then maybe my Halloween costume wasn't dumb, but then why did she look at hers weird, maybe it is dumb, maybe it's high school, maybe it's all so fucking stupid that it hurts my head everyday. Everyone is pretending. I'm tired. I don't wanna pretend. I just wanna be loved. But that's not going to happen because my body does not allow it. I twitch. I hyperventilate. I tell myself to calm down. So I go flat. Now no one wants to hang out with me. I'm tired. I just wanna be safe. But oh don't just go with anyone, they'll hurt you. If you can so easily seek approval from guys who drink in high school with drugs then who are you. I like the nerds, I like the cheerleaders, oh now u like the stoners. You are so fake. I just don't even like anything. I mean I just wanna go home. Idk. Help. I guess this isn't just lonliness but I even feel happy feeling this bad about myself. It's nice, it's comforting. Help. I don't want to work hard anymore what's wrong with me. Please", "score": 5, "num_comments": 6, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1gifv6f/hi_im_not_feeling_too_great/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1gifv6f/hi_im_not_feeling_too_great/", "over_18": false, "removed_by_category": null}
{"id": "1gh3qo3", "subreddit": "lonelinesssupport", "created_utc": 1730462627, "author": "WorryUnique2172", "title": "All my friends cancelled on me ", "selftext": "Hi guys, \nI need to take things off my chest, I don’t have that many people to talk to as it feels very humiliating to me. I moved 2 years ago from Switzerland to London to study. It has been a huge struggle for me to make friends, I have 2 good friends but it doesn’t hit home like my friends back in my home country. \nMy housemates and I are throwing a Halloween party tonight and each invited around 20 people. I invited 10, with some where I hoped I could get to know them better through this event. \nSeveral have cancelled throughout this week which made me sad but it is halloweekend so expected it. What I was not expecting was my closest friends cancelling last minute, with one saying she’s going to another party and the 3 others ( they’re all best friends) cancelling all together. \n\nI feel deeply hurt as I find this so humiliating that I have no one except my brother that are coming. I try my best to be a good friend but I can’t help but feel like I’m not worthy enough and that’s why they all cancelled. \nI struggled with making friends all my life and I used to be bullied as a teen leading to anxiety now. \n\nI am still looking forward to meeting my housemates friends but I usually feel more confident to talk to them if I have a friend by my side, but now that I’m left all alone I’m terrified. \n\n I guess I just want to know if someone relates or has any tips? \nThanks ", "score": 4, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1gh3qo3/all_my_friends_cancelled_on_me/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1gh3qo3/all_my_friends_cancelled_on_me/", "over_18": false, "removed_by_category": null}
{"id": "1gg8zfx", "subreddit": "lonelinesssupport", "created_utc": 1730359959, "author": "OverallSource4", "title": "Everybody In My Life Seemingly Never Have The Time To Truly Be Happy Anymore. Working Constantly And Having To Sleep Off Their Exhaustion Leaves No Time To Have A Proper Conversation. I've Felt Lonely For Many Years Now. I Recently Turned 24 This Month. But I Feel Things Have Just Gotten Tougher.", "selftext": "I know this isn't a unique point in any way. And frankly I know there is no easy fix. This last year has been an insane rollercoaster of emotions. Where I've desperately tried to keep people close.\n\nBut In Fact have let my loneliness allow me to grow bitter with people. I'm lucky not to have let this ruin too many friendships, but one truly amazing friend I lost because of it.\n\nThey were an incredible soul with nothing but love to share. And an outstanding artist. If you'd like to check out their Illustrations & Animations. Please look up ey3mzzzs on Insta.\n\nAnd their Twitch Streams at Nenegrimalkin. They're one of a kind I promise you. I will miss them everyday of my life.\n\nBut Anyway. I just wanted to share this to show how loneliness can make you both vulnerable for others to see. But also very unlikeable if you don't learn to handle it right quickly enough.\n\nI've done my best on dating apps and whatnot to keep myself distracted from these overwhelming feelings. But rarely does this have success for me. I've used them since January this year and haven't had a single date.\n\nI've used close to 10 of them everyday. All I get is a single comment here and there. And a small conversation. Before they disappear once again.\n\nI don't believe my profile is the issue. I have been told I'm good looking by other users who've ‘very occasionally’ spoken to me. I show them I'd be happy to talk to them more. Yet this still never goes anywhere. They all lose interest so fast it would seem.\n\nBut this likely goes back to my main point on work consuming all our creative, passionate opportunities. Leaving us essentially like slaves, working longer hours to survive off the bare minimum remuneration we receive.\n\nMy friends, both in real life and online, are experiencing this more than ever. We used to hang out all day back in College.\n\nAnd even after that came to an end, we had Dscord to chat in calls and play games together. We all worked back then, but it just felt like we actually used to have time to relax.\n\nBut now at 24, adulthood seems to have pulled us apart. Granted some of us live in other places now. One in America, one in Japan, one in Germany, and one in Scotland. But even suggesting a Dscord (Sorry Reddit doesn't like the actual word for some reason) causes such a hefty task for us all these days.\n\nI'm lucky that my job leaves me with more freedom. But honestly, I would give this job to my friends if I could. It would be better for them as they are the most productive, passionate individuals you will ever meet. I would love to see them in a life they can smile in everyday.\n\nSo I guess I'm just wondering whether life will ever change from this economic driven society, hell-bent on destroying any chance for creativity to spawn if it doesn't immediately involve lots of money to be made. Normally for other people you don't even know to exploit.\n\nWhat A World To Be Born Into. Enjoying The Little Things Will Likely Be All We Have Left. For The Indefinite Future. Thank You For Listening. My Issue Is In No Way Unique. But I Believe It Speaks To A World In Serious Need Of Love.", "score": 3, "num_comments": 2, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1gg8zfx/everybody_in_my_life_seemingly_never_have_the/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1gg8zfx/everybody_in_my_life_seemingly_never_have_the/", "over_18": false, "removed_by_category": null}
{"id": "1fsr0d0", "subreddit": "lonelinesssupport", "created_utc": 1727686407, "author": "Cole072911", "title": "I really need a friend rn", "selftext": "Hey my name is Cole I could really use a friend rn some just to talk to\n\nI'm just....I just feel so alone especially since my SH relapse I've realized no one actually gives af. I've been really trying to open up to people since the start of year and I've met two people who I began to trust then they said things, things with the only purpose to hurt me. I tried talking to some of my school mates and well they don't give a shit about me at all they just want to use me and move on. My family life has problems (who's doesn't to be fair)(nothing abusive).\n\nI just need someone to spend time with or at least give me a chance and let me feel cared for a bit I swear it won't be only one sided.\nI'm just so tired of struggling alone and would really appreciate it if u would contact me either via Reddit or something else I prefer insta(coulton.05)\n\nIk most people won't respond and in that case I'm sorry for bothering you and hope u have a great day/night", "score": 5, "num_comments": 3, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1fsr0d0/i_really_need_a_friend_rn/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1fsr0d0/i_really_need_a_friend_rn/", "over_18": false, "removed_by_category": null}
{"id": "1fsqhvi", "subreddit": "lonelinesssupport", "created_utc": 1727683923, "author": "ModernIntrovert", "title": "A Life With No Friends", "selftext": "", "score": 6, "num_comments": 1, "url": "/r/u_ModernIntrovert/comments/1fsqgu2/a_life_with_no_friends/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1fsqhvi/a_life_with_no_friends/", "over_18": false, "removed_by_category": null}
{"id": "1fqfvdu", "subreddit": "lonelinesssupport", "created_utc": 1727412098, "author": "jessjmenacho", "title": "Does anyone want to be my friend? ", "selftext": "I recently moved to a new city and I'm experiencing cultural shock. I try so hard to make connections, but people here avoid eye contact, don't reply to 'hi' or a smile... is it like this in all North America? I'm living in Alberta, Canada. ", "score": 2, "num_comments": 5, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1fqfvdu/does_anyone_want_to_be_my_friend/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1fqfvdu/does_anyone_want_to_be_my_friend/", "over_18": false, "removed_by_category": null}
{"id": "1fjz0ge", "subreddit": "lonelinesssupport", "created_utc": 1726681796, "author": null, "title": "My loneliness life ", "selftext": "Hey myself hunter nice to meet you \nI'm new here \nAnd I'm 34\nFeeling extremely lonely and depressed \nBeen living alone from the age of 14 \nNo family no friends or companionship \nIt's been hard recently 😔 \n", "score": 3, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1fjz0ge/my_loneliness_life/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1fjz0ge/my_loneliness_life/", "over_18": false, "removed_by_category": null}
{"id": "1fgyi6x", "subreddit": "lonelinesssupport", "created_utc": 1726355097, "author": "lightskinjay7736", "title": "It's too late", "selftext": "I 25m have basically lost all but one of my friends and have no one else. While I was locked up everyone basically left. Even though I work damn near a full time job I have been home for 4 months and still live with my grandma. That means dating is out of the question. I have no clue how to make friends. Some days the loneliness is bearable but lately after being ghosted I have been feeling the crushing weight of the loneliness and I don't know how much more i can take. I never thought coming home from prison would be so miserable", "score": 11, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1fgyi6x/its_too_late/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1fgyi6x/its_too_late/", "over_18": false, "removed_by_category": null}
{"id": "1eo3hri", "subreddit": "lonelinesssupport", "created_utc": 1723219284, "author": "Candid_Information57", "title": "This is kind of like a confession, but", "selftext": "I have zero friends. I have work colleagues, and a family, but I do not have any friends. I haven't made a new friend in about 25 years, (I am a 51yo M) and every person I thought was my friend has just sort of faded away over the years. I stopped trying to make friends some time ago, and now am at a point where I have given up on ever having friends and I now assume I have nothing to offer in that regard.\n\nWhat is worse, is being stuck in a bad relationship as I fear loneliness and have no real support to help me leave. But, I don't think I'm a bad person. I'm just sick of pretending I have even one person I can call a friend without it being a stretch. I have felt ashamed of this for many, many years and tried to hide it. \n\nI don't know what I expect from posting here. I just had to admit this to myself.\n\n", "score": 12, "num_comments": 8, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1eo3hri/this_is_kind_of_like_a_confession_but/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1eo3hri/this_is_kind_of_like_a_confession_but/", "over_18": false, "removed_by_category": null}
{"id": "1eaxb03", "subreddit": "lonelinesssupport", "created_utc": 1721814035, "author": "Simbakshi", "title": "A Mental Health Meetup on Loneliness! (Free to attend)", "selftext": "Join us for [Mindhouse](https://www.linkedin.com/company/mindhousehq/)’s ONLINE Mental Health Circle on Loneliness.  \n  \nWhether you're dealing with temporary loneliness or a more chronic sense of disconnection, this group meetup is a safe space to share your experiences and find comfort in knowing you're not alone. Join us from anywhere for our upcoming Online Circle (video call) on 27 July 2024, Saturday at 11 am Indian Standard Time. Register here: [https://tally.so/r/n9d2qQ](https://tally.so/r/n9d2qQ)", "score": 3, "num_comments": 3, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1eaxb03/a_mental_health_meetup_on_loneliness_free_to/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1eaxb03/a_mental_health_meetup_on_loneliness_free_to/", "over_18": false, "removed_by_category": null}
{"id": "1e5ni1f", "subreddit": "lonelinesssupport", "created_utc": 1721236031, "author": "marypc123", "title": "Journalist looking to speak with people for story on reconnecting with old friends", "selftext": "Hi there! My name is Mary and I am a journalist based in NY. I am working on a story about reconnecting with old friends based off a [Scientific American study](https://www.scientificamerican.com/article/how-to-reconnect-with-old-friends-who-have-become-strangers/?utm_source=Live+Audience&utm_campaign=f8586bf0ce-nature-briefing-daily-20240715&utm_medium=email&utm_term=0_b27a691814-f8586bf0ce-498684457) that came out this month and looking to speak to people who have either recently heard from an old friend they lost touch with, or reached to an old friend to reconnect. If either applies to you, I'd love to chat! Feel free to DM me.", "score": 3, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1e5ni1f/journalist_looking_to_speak_with_people_for_story/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1e5ni1f/journalist_looking_to_speak_with_people_for_story/", "over_18": false, "removed_by_category": null}
{"id": "1dz6tn3", "subreddit": "lonelinesssupport", "created_utc": 1720542662, "author": "Jealous-Tradition-94", "title": "A safe haven for the lonely and unsupported 🙏🏽✨", "selftext": "Hey everyone,\n\nI’m Nox, a social media content creator, marketer, and someone deeply passionate about emotional intelligence, self-love, and healing. My journey hasn’t been easy, but it’s led me to create something that I believe can make a real difference in the lives of many: Soul Ink Sanctuary.\n\nA Bit About My Story\n\nFor years, I’ve navigated the rough waters of loneliness and isolation, largely stemming from Childhood Emotional Neglect (CEN) and Complex Post-Traumatic Stress Disorder (CPTSD). These experiences have shaped me, but they’ve also driven me to seek out ways to heal and connect with others who understand these struggles.\n\nThroughout my journey, I’ve found solace in spirituality, yoga, reiki, and various healing practices. However, the most significant healing came from connecting with others who shared similar experiences. This realization inspired me to create Soul Ink Sanctuary, a community where we can come together to support and uplift one another.\n\nWhat is Soul Ink Sanctuary?\n\nSoul Ink is a vibrant, supportive community dedicated to helping individuals navigate through the complexities of emotional healing and personal growth. Our space is designed for those who have experienced CEN, CPTSD, or anyone seeking a compassionate community to share their journey with.\n\nOur Mission\n\nAt Soul Ink, our mission is to create a safe haven where people can come together to heal, grow, and support one another. We believe in the power of shared experiences and the strength found in community. Whether you’re looking to share your story, offer support, or simply be in the presence of understanding individuals, Soul Ink is here for you.\n\nWho We Serve\n\n\t•\tIndividuals who have experienced CEN and CPTSD\n\t•\tThose seeking a supportive, non-judgmental community\n\t•\tAnyone on a journey of self-discovery and healing\n\nWhy Join Our Discord Community?\n\nOur Discord channel offers a space for real-time conversations, support groups, and various resources to aid in your healing journey. It’s a place where you can find:\n\n\t•\tSupportive discussions on topics like emotional intelligence, self-love, and healing practices.\n\t•\tWorkshops and events led by experienced individuals in the field of mental health and wellness.\n\t•\tA safe space to share your experiences and receive empathy and encouragement from others who understand.\n\nJoin Us Today!\n\nIf you’re looking for a community that understands and supports your healing journey, we invite you to join us on Discord. Let’s grow and heal together.\n\nJoin Soul Ink Sanctuary on Discord\nhttps://discord.gg/SYS754sVp2\n\nWe can’t wait to welcome you!\n\nWarm regards,\nNox\n", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1dz6tn3/a_safe_haven_for_the_lonely_and_unsupported/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1dz6tn3/a_safe_haven_for_the_lonely_and_unsupported/", "over_18": false, "removed_by_category": null}
{"id": "1dhe4nt", "subreddit": "lonelinesssupport", "created_utc": 1718563099, "author": "prkp", "title": "Looking for people for an interview.", "selftext": "I'm Max, and I'm 27. I've felt lonely for most of my life, often without even realizing it. This led me to start researching loneliness and how it affects us.\n\nI'm looking to speak with people about their experiences of loneliness. Your insights would be super helpful for my research. If you're up for a casual interview about how loneliness affects you and any thoughts you have on the subject, I'd love to hear from you.\n\nIt would take about 15-20 minutes over Zoom. No video, just voice.\n\nEverything you share will stay anonymous, and our conversation will be relaxed and informal. If you're interested or have any questions, just shoot me a message.\n\nThanks for considering it, and I hope to talk to someone of you here! Just drop a comment here or dm me.", "score": 3, "num_comments": 2, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1dhe4nt/looking_for_people_for_an_interview/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1dhe4nt/looking_for_people_for_an_interview/", "over_18": false, "removed_by_category": null}
{"id": "1cus1p1", "subreddit": "lonelinesssupport", "created_utc": 1716018182, "author": "anicca3", "title": "Feeling lonely. What's stopping us from connecting?", "selftext": "Hey\n\nI've been feeling pretty lonely lately and I wanted to open up about it here, hoping maybe some of you can relate or have advice.\n\nI didn't grow up in the city I live in, so I missed out on making those long-term friends from school that a lot of people seem to have.\n\nI work as a solo gig worker, which means I don't naturally make connections like you would in an office setting. It's tough.\n\nI try to go to events to meet people, but it's hit or miss.\n\nSometimes it feels like people don't really value new connections because they have so many options, or maybe it's just too much effort to keep meeting up.\n\nIt's hard dropping everything to meet someone, especially when the initial excitement fades and reality sets in.\n\n--\n\nDoes anyone else feel lonely as well?\n\nWhat are the main barriers for you to making and keeping friends?\n\nIs it our busy lifestyles, work demands, societal expectations, or something else like fear of meeting creeps or just the effort it takes to maintain relationships?\n\nWould love to hear your thoughts and experiences. Thanks for listening.", "score": 6, "num_comments": 3, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1cus1p1/feeling_lonely_whats_stopping_us_from_connecting/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1cus1p1/feeling_lonely_whats_stopping_us_from_connecting/", "over_18": false, "removed_by_category": null}
{"id": "1c6bhsz", "subreddit": "lonelinesssupport", "created_utc": 1713364541, "author": "Independent_Juice636", "title": "Loneliness", "selftext": "You know I really surprised at how life has turned out for me! I have one child not because I didn’t want more but couldn’t have anymore. I had 5 miscarriages and one ectopic pregnancy but God blessed me finally with one daughter. There is nothing that I didn’t do for my daughter! She was my miracle baby. Today she is 33 years old and married. She lives in Georgia. This child has broken my heart! Her and her husband make more money in one year than I make in 10 years. She decided she didn’t think it was important to acknowledge my Birthday this year. It’s not about the money but the thought. She said she didn’t think we were buying each other anything anymore?? I never said that. I’m the only mother she will ever have and she just doesn’t care. She never calls me and I honestly don’t get to see he often. I’m just done being treated this way. I’m still married to her father but being married to him is like not being married at all he doesn’t touch me. I know that’s probably to much unwanted information but my life is so lonely! I just took for granted that I would have some grand kids like my friends but no I don’t think that’s ever going to happen. My mom died 9 years ago of cancer. She was my everything. I always thought of my mom on special days and bought her things all the time. I guess I thought my relationship with my daughter would be as good as my relationship with my mom but no! I love her more than anything but she has always been a selfish person. All I can do now is give it to God!", "score": 4, "num_comments": 2, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1c6bhsz/loneliness/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1c6bhsz/loneliness/", "over_18": false, "removed_by_category": null}
{"id": "1c502cs", "subreddit": "lonelinesssupport", "created_utc": 1713221194, "author": "Comfortable-Door-740", "title": "Loneliness in 20s while chasing dreams", "selftext": "Well, I've always been a lonely one since childhood who's live revolves into thinking about families. I belong to lower middle class and a close knit society. We used to shift from one house to another because the owners would insist we get out of their homes due to reasons like they want to increase the reason or they just don't like us. So as a kid I used to keenly observe and was made to feel so cautious of everything i do. My siblings well they r too competitive and their outlook kind of seep to me too and I can't take it with a pinch of salt. Unlike many child, all I think of a kid was to have a better life, dignified one. Had very low self esteem. So growing up I could barely make friends:1st I don't like the friends that I can have, 2nd I never get to bw friend with those friends i like. I do have a good friend but I was never satisfied. I want a smart, well to do friend..not just kind and loyal. So I push really hard and has begun to perceive friendship as \"friends for benefits\" as my siblings told me that nobody is your friend if you don't become someone in live. So I was very insecure and I only realise how lonely i was until I get some of these validation. But I had lost many friends. Even now I feel so lonely because I don't get to be around people I like.even now I do have friends but just not my people type.. and well I also never attend much social events as I have to study always.", "score": 6, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1c502cs/loneliness_in_20s_while_chasing_dreams/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1c502cs/loneliness_in_20s_while_chasing_dreams/", "over_18": false, "removed_by_category": null}
{"id": "1c4rfth", "subreddit": "lonelinesssupport", "created_utc": 1713200697, "author": "4elysian", "title": "I'm free but still in prison ", "selftext": "I am free as a person. I can do what I want but I feel imprisoned by myself. I am in a prison and have been long enough. the reason why i am imprisoned is the fear i have of a person. the person themselves said they destroyed my confidence because they didn't want me to reach my highest potential as it scared them.\nI think it's awfully cruel to do so as I feel trapped and can't depend on my own judgment nor do anything about this problem. Idk if there is someone out there that feels this way, but please if there is tell me that I'm not alone as for now this horrendous loneliness is getting to me.", "score": 3, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1c4rfth/im_free_but_still_in_prison/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1c4rfth/im_free_but_still_in_prison/", "over_18": false, "removed_by_category": null}
{"id": "1bqg07b", "subreddit": "lonelinesssupport", "created_utc": 1711685110, "author": "jkwway", "title": "Any advice? ", "selftext": "Sorry, I’m using google translate, my English is not good enough. \n\nHello. I'm writing here on Reddit in hopes of finding support or some advice. I am 21 years old and recently I moved away from my parents and began to live alone because of my new job. The first two months seemed like living in hell for me... It had never been so difficult for me, both mentally and physically. It’s so lonely that you just think you’re slowly going crazy. I cried every night, my heart was very heavy, I had no one to talk to, all my online friends left me and im all here by myself. At work, any motivation disappears, and you struggle to get out of bed. Sometimes I just want to give up everything and go back to my family. I really miss love and care, moral support, knowing that someone is nearby and will always support you. Sometimes I just want a simple hug. And when they hug you, they will tell you “Everything is fine, I’m here with you”. At work, I start to stress a lot, and due to a lot of stress, I started having panic attacks and always feeling that I can’t fully breathe, especially at night, knowing that I am all alone and there was no one around to calm me down was simply unbearable. I don’t know how to deal with this anymore, every day is worse than the next.", "score": 3, "num_comments": 2, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1bqg07b/any_advice/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1bqg07b/any_advice/", "over_18": false, "removed_by_category": null}
{"id": "1bhtlf7", "subreddit": "lonelinesssupport", "created_utc": 1710775980, "author": "epRe-engage", "title": "UK Call Companions for over 75s facing loneliness", "selftext": "My name is Ellie and I wanted to let you know that we still have spaces for persons aged 75+ in the UK  to sign up for a phone buddy via our free call companion service: [Find a call companion: phone befriending & companionship (reengage.org.uk)](https://www.reengage.org.uk/join-a-group/get-a-call-companion/)\n\nWe need a little help reaching those who are older and isolated, so if you are aware of any older people (75+) within your community, you can refer them to Re-Engage charity (with their consent, of course) for support. Referrals can be made quickly and easily through the online form, accessible via the following link: [www.reengage.org.uk/refer/form/](http://www.reengage.org.uk/refer/form/) and select Call Companions, or check out our other services.\n\nPlease help over 75s find connections and tackle loneliness- [ellie.plummer@reengage.org.uk](mailto:ellie.plummer@reengage.org.uk) our volunteers are DBS checked and trained by the charity Re-engage", "score": 3, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1bhtlf7/uk_call_companions_for_over_75s_facing_loneliness/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1bhtlf7/uk_call_companions_for_over_75s_facing_loneliness/", "over_18": false, "removed_by_category": null}
{"id": "1atzhs5", "subreddit": "lonelinesssupport", "created_utc": 1708277374, "author": "process-oriented", "title": "Ways to have it feel like someone is \"along for the ride\"?", "selftext": "I have a friend who spends a lot of time alone at home by herself.  We just started scheming about ways that she could feel less alone because she would periodically share with me via text.  I would then text her back when I got the chance.  But, I'm guessing what I have to say in my reply would tend to be more of just an acknowledgment than something more substantial.  Not sure yet.  What have people tried along these lines?  What are some factors that make you feel more or less connected to the person supporting you when doing something like this?", "score": 2, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1atzhs5/ways_to_have_it_feel_like_someone_is_along_for/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1atzhs5/ways_to_have_it_feel_like_someone_is_along_for/", "over_18": false, "removed_by_category": null}
{"id": "1amo8us", "subreddit": "lonelinesssupport", "created_utc": 1707485625, "author": "Significant-Guide733", "title": "'A Message from Lonely Planet' | Poem", "selftext": "[https://www.youtube.com/watch?v=dF0FTTb7sKI](https://www.youtube.com/watch?v=dF0FTTb7sKI)", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/1amo8us/a_message_from_lonely_planet_poem/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1amo8us/a_message_from_lonely_planet_poem/", "over_18": false, "removed_by_category": null}
{"id": "18xl94k", "subreddit": "lonelinesssupport", "created_utc": 1704293751, "author": "wewewawa", "title": "What does it mean to be lonely? Here’s what it can mean and how to cope with loneliness.", "selftext": "", "score": 2, "num_comments": 0, "url": "https://www.vox.com/even-better/24006316/feeling-lonely-social-emotional-existential-loneliness-epidemic", "permalink": "https://reddit.com/r/lonelinesssupport/comments/18xl94k/what_does_it_mean_to_be_lonely_heres_what_it_can/", "over_18": false, "removed_by_category": null}
{"id": "18l3mnj", "subreddit": "lonelinesssupport", "created_utc": 1702886952, "author": "Justneedtoescape", "title": "Lost and lonely", "selftext": "My wife of almost 20 years and I now live apart. I don’t know if I want to be with her again, but I’m so damned lonely every day. I have two dogs and they’re my only interaction. I don’t leave the house except for groceries. I don’t talk to anyone. I feel as though every day is a chore and the exact same thing. I just turned 60 and am craving to talk with someone in a similar situation.", "score": 7, "num_comments": 3, "url": "https://www.reddit.com/r/lonelinesssupport/comments/18l3mnj/lost_and_lonely/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/18l3mnj/lost_and_lonely/", "over_18": false, "removed_by_category": null}
{"id": "17qqonp", "subreddit": "lonelinesssupport", "created_utc": 1699464362, "author": "Reasonable-Fox-3081", "title": "I am lonely and I don't think I deserve love", "selftext": "I am a Male (25) and in comparison to people my age, I have been successful both in life and career. As the saying goes \"We can't have everything in this world\", Maybe in exchange for my successful career and future, the universe has inhibited me with of good relationships with other women. And possibly a happy, married life.", "score": 4, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/17qqonp/i_am_lonely_and_i_dont_think_i_deserve_love/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/17qqonp/i_am_lonely_and_i_dont_think_i_deserve_love/", "over_18": false, "removed_by_category": null}
{"id": "16c2fsj", "subreddit": "lonelinesssupport", "created_utc": 1694049906, "author": "TranzFloofyBean", "title": "Dealing with a lot rn.. :c", "selftext": "I don’t use Reddit a lot or even at all and this is my first post and I don’t even know if anyone would see this but I’m so tired of living here I feel like I don’t even have a reason or purpose anymore or like I ever did it’s like I’m staying for nothing. It’s like people used to care but over time they just stopped.. and all I do is put everything into a relationship all the reaching out responding effort time and energy when no one ever does the same.. I just want someone to care about me and put the same amount of time energy and effort into the relationship I want someone to say goodnight and good morning to me someone to call someone that invites me to hang out and I know this’ll sound weird but someone to hug cuddle or snuggle with I’m just so attention affection and touch starved/deprived I mean I can’t even feel love from people anymore because of my trauma like it hurts it hurts so much to live and see everyone else be getting that but you. I just can’t keep doing this anymore- :c", "score": 7, "num_comments": 15, "url": "https://www.reddit.com/r/lonelinesssupport/comments/16c2fsj/dealing_with_a_lot_rn_c/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/16c2fsj/dealing_with_a_lot_rn_c/", "over_18": false, "removed_by_category": null}
{"id": "16c0m76", "subreddit": "lonelinesssupport", "created_utc": 1694045070, "author": null, "title": "I miss my mom...😟😢😭💔>🖤", "selftext": "When I was born, my mom was doing dr*gs and couldn't take care of me. Now it's 2023 and on my birthday she told me \"I'll see you soon\". It's been 2 months and 6 days since that. I've been depressed.", "score": 3, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/16c0m76/i_miss_my_mom/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/16c0m76/i_miss_my_mom/", "over_18": false, "removed_by_category": null}
{"id": "16aarz0", "subreddit": "lonelinesssupport", "created_utc": 1693878212, "author": null, "title": "I need advice", "selftext": "So, I have depression, have had it for a while now. I try to keep it hidden, but really hard. I'm afraid my family will think bad abt my parents if I show any depression. I am also afraid to talk to my parents about it. Any advice?", "score": 2, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/16aarz0/i_need_advice/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/16aarz0/i_need_advice/", "over_18": false, "removed_by_category": null}
{"id": "163z2ri", "subreddit": "lonelinesssupport", "created_utc": 1693259023, "author": "my-way-or-highway", "title": "Trying to find a solution", "selftext": "I've(M-26) been single for 3 years. After I moved to another country permanently, the loneliness I had, got worse and it depresses me seriously. Even though I am not that attractive, my friends say the opposite( I might have lack of confidence).\n\nI am not one of those guys who can do anyything to sleep with women. I don't wanna seem like/become like f*ckboy. Since I've been single, I don't have sex life for a long time. I could have sex but I don't want to do it with someone who is lower my league.\n\nI don't like going out by myself. I guess I am not good at socializing.\nI really don't know what to do.", "score": 4, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/163z2ri/trying_to_find_a_solution/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/163z2ri/trying_to_find_a_solution/", "over_18": false, "removed_by_category": null}
{"id": "150wo92", "subreddit": "lonelinesssupport", "created_utc": 1689482216, "author": "UnconventionalM", "title": "Overwhelming Loneliness", "selftext": "Hello Everyone. I am feeling an indescribable amount of lonliness. I lived with my Dad for 53 years of my life. He passed away a couple of years ago. I am now 55 and it is still extremely difficult living alone. I really need a caring friend that I can talk to throughout the week. ", "score": 4, "num_comments": 3, "url": "https://www.reddit.com/r/lonelinesssupport/comments/150wo92/overwhelming_loneliness/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/150wo92/overwhelming_loneliness/", "over_18": false, "removed_by_category": null}
{"id": "14wgptd", "subreddit": "lonelinesssupport", "created_utc": 1689049654, "author": "SolidSeaSalt", "title": "For those of us who find ourselves feeling isolated or lonely, a tangible letter carries with it the comforting reminder of human connection.", "selftext": "&#x200B;\n\nhttps://preview.redd.it/b0v1re1sj9bb1.png?width=902&format=png&auto=webp&s=bc71adc5745f1604d14e1831b09e8e17511ae7f8", "score": 3, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/14wgptd/for_those_of_us_who_find_ourselves_feeling/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/14wgptd/for_those_of_us_who_find_ourselves_feeling/", "over_18": false, "removed_by_category": null}
{"id": "13hpfxh", "subreddit": "lonelinesssupport", "created_utc": 1684103340, "author": "SevereMongoose1863", "title": "i need advice :(", "selftext": "i feel really lonely and sad :( i cry all days and feel tired all the time. where to find friends?", "score": 1, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/13hpfxh/i_need_advice/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/13hpfxh/i_need_advice/", "over_18": false, "removed_by_category": null}
{"id": "12698i1", "subreddit": "lonelinesssupport", "created_utc": 1680144705, "author": "Daveman-620_2000", "title": "My Journey In Life | DISCOVERING MY PURPOSE | (David S. Hooker)", "selftext": "", "score": 1, "num_comments": 0, "url": "https://youtube.com/watch?v=fVnp-MMfBPA&feature=share", "permalink": "https://reddit.com/r/lonelinesssupport/comments/12698i1/my_journey_in_life_discovering_my_purpose_david_s/", "over_18": false, "removed_by_category": null}
{"id": "11qhqn7", "subreddit": "lonelinesssupport", "created_utc": 1678732911, "author": "Daveman-620_2000", "title": "\"I will never leave you\" (vent)", "selftext": "", "score": 2, "num_comments": 0, "url": "https://youtube.com/watch?v=G1Zb_94n6c4&feature=share", "permalink": "https://reddit.com/r/lonelinesssupport/comments/11qhqn7/i_will_never_leave_you_vent/", "over_18": false, "removed_by_category": null}
{"id": "1158yok", "subreddit": "lonelinesssupport", "created_utc": 1676702311, "author": "Daveman-620_2000", "title": "Fighting Against Myself✨", "selftext": "", "score": 1, "num_comments": 0, "url": "https://youtube.com/watch?v=LvksCluZLIc&feature=share", "permalink": "https://reddit.com/r/lonelinesssupport/comments/1158yok/fighting_against_myself/", "over_18": false, "removed_by_category": null}
{"id": "113h5a8", "subreddit": "lonelinesssupport", "created_utc": 1676519147, "author": "jeffr3y11", "title": "Not having anyone", "selftext": "So I'm 22 now, and since high school I've always felt very lonely and I always heard that you can feel lonely even though there's people around you. However, km like truly alone, I don't remember ever having anyone wanting to be my friend, much less having any romantic/sexual interest in me. I don't know if there is something wrong with, but I feel so bad about it everyday, I feel like I'm missing on life.", "score": 3, "num_comments": 3, "url": "https://www.reddit.com/r/lonelinesssupport/comments/113h5a8/not_having_anyone/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/113h5a8/not_having_anyone/", "over_18": false, "removed_by_category": null}
{"id": "10s64pg", "subreddit": "lonelinesssupport", "created_utc": 1675384772, "author": "krisriz", "title": "Dissertation Survey", "selftext": "Hi! My name is Kristin and I'm a doctoral clinical psychology student at Midwestern University. Please consider clicking on the link to complete a survey for my dissertation. Much appreciated!\n\n[https://redcap.midwestern.edu/surveys/?s=33JRFNM8FF](https://redcap.midwestern.edu/surveys/?s=33JRFNM8FF)\n\n&#x200B;\n\nhttps://preview.redd.it/ey6ei9dkdvfa1.png?width=1566&format=png&auto=webp&s=02bf43dcaa2191b333d00d570bf93c3e65d2683e", "score": 2, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/10s64pg/dissertation_survey/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/10s64pg/dissertation_survey/", "over_18": false, "removed_by_category": null}
{"id": "101vv11", "subreddit": "lonelinesssupport", "created_utc": 1672713824, "author": "One_Ad3051", "title": "A lonely girl in her late 20s", "selftext": "Hi ✨ I just joined the subreddit. I feel really isolated and lonely ever since last year but like a lot of months ago. I feel like people barely care about me. I am trying to stay positive but sometimes i just want to lay down and cry the entire day. Any advice?", "score": 3, "num_comments": 5, "url": "https://www.reddit.com/r/lonelinesssupport/comments/101vv11/a_lonely_girl_in_her_late_20s/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/101vv11/a_lonely_girl_in_her_late_20s/", "over_18": false, "removed_by_category": null}
{"id": "100xg58", "subreddit": "lonelinesssupport", "created_utc": 1672617310, "author": "ClassGullible4343", "title": "Look at me", "selftext": "So I'm having a hard time with my people not bothering to reply to my messages to them.", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/100xg58/look_at_me/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/100xg58/look_at_me/", "over_18": false, "removed_by_category": null}
{"id": "zzmqu2", "subreddit": "lonelinesssupport", "created_utc": 1672465530, "author": "Puzzleheaded_Fill225", "title": "Loneliness Help", "selftext": "Hello Everyone, \nSo, I am a uni grad now working a corporate job. B4 COVID I was unhealthy, fat and depressed but after I got healthier but my depression hasn’t gone. More noticeable if my loneliness, I am more confident than before but I don’t know how to make friends anymore. What affects me more is my inability to get women, I just don’t know how and maybe I’m just being a bum. I have tried to be more involved in events but I tend to feel more lonely cuz I don’t have anybody to be with. I know people but not like anybody  needs me in their company. And my job is affecting me too, I was steps away from taking myself anyway from this world once. Although this is primarily because I know I don’t have a serious social life and I don’t know what to do. I have amazing parents but not having serious friends or a girlfriend sucks and being an only child doesn’t help. Any advice would be greatly appreciated, thanks in advance.", "score": 2, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/zzmqu2/loneliness_help/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/zzmqu2/loneliness_help/", "over_18": false, "removed_by_category": null}
{"id": "yzsiw7", "subreddit": "lonelinesssupport", "created_utc": 1668910240, "author": "brett23freeman", "title": "Loneliness in spouses family gatherings", "selftext": "So I am a man who grew up in a single parent family. Meaning I have never had any other family members outside of just my mom.. she passed when I turned 18 and now (24) I am a year into a relationship with a woman with a fairly decent size family. I feel very alone and out of place when my spouse mingles amongst her family. Like I tend to sit alone quietly during the gatherings.. I don't say anything unless spoken to because I'm so afraid of saying something dumb or embarrassing myself (which normally isn't an issue Infront of people I don't care to know or to leave a good impression on.). Any tips on what I should do to feel less alone or to make it easier to mingle. Btw my spouse doesn't really talk to me or introduce me either.", "score": 1, "num_comments": 3, "url": "https://www.reddit.com/r/lonelinesssupport/comments/yzsiw7/loneliness_in_spouses_family_gatherings/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/yzsiw7/loneliness_in_spouses_family_gatherings/", "over_18": false, "removed_by_category": null}
{"id": "x3p7uj", "subreddit": "lonelinesssupport", "created_utc": 1662084071, "author": "Daveman-620_2000", "title": "A little message: BE PATIENT✨💖", "selftext": "", "score": 1, "num_comments": 0, "url": "https://youtube.com/watch?v=BPCMsR30ilA&feature=share", "permalink": "https://reddit.com/r/lonelinesssupport/comments/x3p7uj/a_little_message_be_patient/", "over_18": false, "removed_by_category": null}
{"id": "x279og", "subreddit": "lonelinesssupport", "created_utc": 1661931076, "author": "UnderstandingTime182", "title": "wanna talk", "selftext": "Tbh i don't have much friends to share feelings and..... that's am feeling low these days", "score": 1, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/x279og/wanna_talk/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/x279og/wanna_talk/", "over_18": false, "removed_by_category": null}
{"id": "wxi747", "subreddit": "lonelinesssupport", "created_utc": 1661443721, "author": "thestonermagician", "title": "Finished Uni, all my friends are in relationships, and I don't have any friends back home where I'm living now", "selftext": "It's been 3 months since I graduated university. I obviously had to move back home with my parents in a bit of town where I only had a few friends from secondary school. All these friends have now moved away to different universities and I am now all alone and I am so bored and sad everyday due to the loneliness. My best mate from uni got into a relationship around 5 months ago and I literally very rarely get to speak to him anymore because he is busy with his girlfriend and he works 2 jobs. I on the other hand was dumped 5 months ago on the same day my friend got his girlfriend so you can see hoe shitty that must feel. I also seem to be unemployable as I have applied for 146 jobs and I haven't had a single interview even though whilst at university I had a job working as a waiter. Life just seems so slow moving now and I don't have anything to do to fill my time as I just hate being on my own all yhe time and I don't know where to find or make friends in my city anymore. I don't see anyone my age hanging around. Anyone else have similar issues?", "score": 3, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/wxi747/finished_uni_all_my_friends_are_in_relationships/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/wxi747/finished_uni_all_my_friends_are_in_relationships/", "over_18": false, "removed_by_category": null}
{"id": "vytdl1", "subreddit": "lonelinesssupport", "created_utc": 1657797312, "author": "Different_Program415", "title": "Self-pity and the pity of others", "selftext": "You know,people are always saying \"Don't feel sorry for yourself\" or else \"I don't want your pity\".Is\n\nthere something wrong with me,because to me it feels like they are saying I shouldn't have compassion for myself or,in the latter case,it's wrong to want compassion for others.Maybe I'm\n\njust pathetic,but I unabashedly feel sorry for myself when the world hurts me and I am flattered\n\non the very rare occasion when somebody has pity for [me.Am](https://me.Am) I missing something? Am I a jerk for\n\nfeeling this way?", "score": 1, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/vytdl1/selfpity_and_the_pity_of_others/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/vytdl1/selfpity_and_the_pity_of_others/", "over_18": false, "removed_by_category": null}
{"id": "ufuulj", "subreddit": "lonelinesssupport", "created_utc": 1651391084, "author": "imtooshortt", "title": "please give voice. I think people here should try to chat with each other. Meet at the bottom of this post.", "selftext": "", "score": 3, "num_comments": 1, "url": "https://www.reddit.com/r/lonelinesssupport/comments/ufuulj/please_give_voice_i_think_people_here_should_try/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/ufuulj/please_give_voice_i_think_people_here_should_try/", "over_18": false, "removed_by_category": null}
{"id": "udblk4", "subreddit": "lonelinesssupport", "created_utc": 1651087520, "author": "imtooshortt", "title": "Has anyone had therapy for the forever single state? If yes, can I ask you some questions?", "selftext": "", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/udblk4/has_anyone_had_therapy_for_the_forever_single/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/udblk4/has_anyone_had_therapy_for_the_forever_single/", "over_18": false, "removed_by_category": null}
{"id": "tsoo40", "subreddit": "lonelinesssupport", "created_utc": 1648690607, "author": null, "title": "Just like my best and only friend", "selftext": "", "score": 2, "num_comments": 1, "url": "/r/BreakUps_Help/comments/tsol4m/longtime_bf_of_2_years_and_i_just_broke_up_just/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/tsoo40/just_like_my_best_and_only_friend/", "over_18": false, "removed_by_category": null}
{"id": "sna0vx", "subreddit": "lonelinesssupport", "created_utc": 1644291612, "author": null, "title": "Frustration with social interactions", "selftext": "", "score": 2, "num_comments": 1, "url": "/r/AutismInWomen/comments/sna02a/frustration_from_connecting_with_others/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/sna0vx/frustration_with_social_interactions/", "over_18": false, "removed_by_category": null}
{"id": "smvjyj", "subreddit": "lonelinesssupport", "created_utc": 1644254597, "author": "Holiday-Fix2882", "title": "Hey guys Im 16 years old in grade 11 I just started semester 2 and I’m in different classes than all my friends that I’m close with. And it’s just completely made me depressed from loneliness, I can’t move on from those people, I have this whole in my heart that can be filled by them", "selftext": "I’m depressed and lonely all day at school \nSomeone plz help", "score": 2, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/smvjyj/hey_guys_im_16_years_old_in_grade_11_i_just/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/smvjyj/hey_guys_im_16_years_old_in_grade_11_i_just/", "over_18": false, "removed_by_category": null}
{"id": "sdcjuv", "subreddit": "lonelinesssupport", "created_utc": 1643221200, "author": null, "title": "Moving out?", "selftext": "", "score": 1, "num_comments": 0, "url": "/r/AutismInWomen/comments/sance7/living_with_your_boyfriend_or_friends_anyone/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/sdcjuv/moving_out/", "over_18": false, "removed_by_category": null}
{"id": "r04uma", "subreddit": "lonelinesssupport", "created_utc": 1637641709, "author": "Dismal_Pattern2460", "title": "5 Tips for a Thanksgiving Alone", "selftext": "", "score": 2, "num_comments": 0, "url": "https://upsidedownflan.com/holidays/5-tips-for-a-thanksgiving-alone/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/r04uma/5_tips_for_a_thanksgiving_alone/", "over_18": false, "removed_by_category": null}
{"id": "odb0s0", "subreddit": "lonelinesssupport", "created_utc": 1625363857, "author": "Long-Bass6671", "title": "My boyfriend feels lonely", "selftext": "Hi. My boyfriend (23) is getting random but strong feelings of loneliness in the past few weeks. He lives alone and works the night shift. I live with roommates and study and have 2 works all in the morning and afternoon. I don't really have much free time and almost all of my free time is either for school or for being with him. Sometimes I stay 2 days in his house if I don't have classes on one of the mornings and sometimes he comes and stays at my place for a couple of days once a week.  We both work 6/7 days a week. He is starting to feel really lonely when he gets from work and has started to think about moving in together a lot. I (19) don't feel ready to move in with him any time soon, maybe after finishing college, or even after getting married. I think that we are in a good place on the relationship, we talk everyday and we continue to grow together as well as growing individually but it's been hard not having the same schedule. Because when I wake up he is just arriving from work and when I finish my day he is getting ready to leave. I want to help him feel better but I don't know how. Anyone has any advise/ideas?\n\nThank you", "score": 2, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/odb0s0/my_boyfriend_feels_lonely/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/odb0s0/my_boyfriend_feels_lonely/", "over_18": false, "removed_by_category": null}
{"id": "o5criw", "subreddit": "lonelinesssupport", "created_utc": 1624331027, "author": "UnderstandingTime182", "title": "Where is the fun", "selftext": "If you think seriously about about it then the things we do to reach out for our goals, gives us the main us and you will only feel loneliness after finishing the work and will think about how much fun it was to do those things while in those days you use to sick of those things but now  you will wish to live that life again", "score": 3, "num_comments": 32, "url": "https://www.reddit.com/r/lonelinesssupport/comments/o5criw/where_is_the_fun/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/o5criw/where_is_the_fun/", "over_18": false, "removed_by_category": null}
{"id": "mrv944", "subreddit": "lonelinesssupport", "created_utc": 1618545129, "author": "Ok_Bumblebee4498", "title": "I feel like I'm smothering him", "selftext": "My bf and I have been long distance for 3 years as we're both in college, luckily just a few towns over so we can see each other on the weekends though. I have a horrible roommate situation and can't really keep in-person contact with my friends, for obvious reasons, and will be starting a hiatus from work tomorrow due to poor mental health and school. With all of this combined I feel like I'm leaning on my bf far too much and worry that I'm smothering him. He has a slightly better roommate situation and is a far more solitary person than I am, so he's fine with the limited in-person contact that he has now. I just feel like I've fallen overboard and he's the rope that was thrown to me, but I'm worried that if I pull too hard it'll break.", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/mrv944/i_feel_like_im_smothering_him/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/mrv944/i_feel_like_im_smothering_him/", "over_18": false, "removed_by_category": null}
{"id": "mmm0tu", "subreddit": "lonelinesssupport", "created_utc": 1617864792, "author": "Tall_Damage_6561", "title": "the truth about life", "selftext": "can’t you see it ? when you look one way and someone is telling you to look another way it’s the way that they see themselves and would like for you to see it out there way too so they won’t be alone???.........bcs i can :(", "score": 1, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/mmm0tu/the_truth_about_life/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/mmm0tu/the_truth_about_life/", "over_18": false, "removed_by_category": null}
{"id": "lqdyhd", "subreddit": "lonelinesssupport", "created_utc": 1614070982, "author": "HazyBlueTwilight", "title": "Both lonely and pushing people away? Why do I do this?", "selftext": "I am quite old. And I am too tired to be social. I used to have lots of friends, but now I have none. I don't have a family or a reliable job. I spend almost every day fearful for my future, or wishing that it would all just end. I guess this goes beyond loneliness, but it's like I'm both lonely and so unhappy with myself that I can't be around people -- all at the same time. Does anyone know what I mean? Or am I all alone in these experiences too? No one I know (or have ever known) lives like this.", "score": 6, "num_comments": 7, "url": "https://www.reddit.com/r/lonelinesssupport/comments/lqdyhd/both_lonely_and_pushing_people_away_why_do_i_do/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/lqdyhd/both_lonely_and_pushing_people_away_why_do_i_do/", "over_18": false, "removed_by_category": null}
{"id": "lj55av", "subreddit": "lonelinesssupport", "created_utc": 1613238154, "author": "Downtown-Wasabi-9813", "title": "I’m a 20yo mum with no friends or family. Somehow.", "selftext": "It’s so weird to see everyone else go to uni and finish college, with heaps of friends. I had a baby last June, my daughters so so cool despite only being 8 months old. She’s my world, but I find myself completely alone. All the time. My relationship is falling apart I feel I’m days away from losing the person I wanted to marry, he’s become angry and emotionally abusive since we had a baby. He’s not coping well and honestly neither am I. Anyone I used to know has just cut me off, no one my age is interested in being in contact with someone who has a baby. So many people my age think they’re gross, I know I did a few years ago. \nHow do I even make friends, I’ve always been the loner edgy kid that eats lunch alone, any people I spoke to in school would tolerate me being around but block me out of conversations and ignore me all the time. \n\nIf there’s anyone here that’s a young parent I’d love to keep in touch. I’m in the UK, but friends around the world could be cool. I’m into art and wanna become a tattoo artist at some point in my life, I play league of legends when I get the chance (honestly maybe once a week at the moment) and really enjoy stupid conversations about things that don’t matter. I really wanna get into using VR chat or discord or something but I can’t afford VR stuff at the moment. I’m just desperate for someone to appreciate me being around and to see me more than just a worn out dead beat young mum who’s life is already over.", "score": 2, "num_comments": 2, "url": "https://www.reddit.com/r/lonelinesssupport/comments/lj55av/im_a_20yo_mum_with_no_friends_or_family_somehow/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/lj55av/im_a_20yo_mum_with_no_friends_or_family_somehow/", "over_18": false, "removed_by_category": null}
{"id": "lcosa4", "subreddit": "lonelinesssupport", "created_utc": 1612469408, "author": "JonBritt101", "title": "I have been dealing with loneliness and social anxiety due to investing in people and getting nothing back. I worry so much about future relationships. I’ve never had that one TRUE friend, which hurts.", "selftext": "Relationships scare me. I have invested so much in a lot of people that I considered friends. I got nothing back. No one invested in me one-on-one. None of these people reciprocated. Due to this, I have developed slight social and general anxiety.\n\nI have slight anxiety when it comes to investing people, because I have done so in the past, and I got nothing back. Due to this, I have also trust issues because I don’t know if the next person I invest in will reciprocate.\n\nBack in High School, I had people I considered true friends, but they never invested in me. I did all the planning of events, most of the talking, or none at all. In group settings, they were great people, but none of them reached out to me on a one-on-one basis. I kept investing in them, hoping that they would invest back into me, but they never did. This went on all 4 years of my high school. Due to this cycle of investing and getting nothing back, I eventually cut ties with those people, which was difficult to do. When I got to college, the same thing happened. I always dreaded hanging out as a group, even though I acted like I wanted to be there. But I didn’t. I still kept hanging with them in group settings. Outside of the group, whenever I texted asking if anyone wanted to get together, I was met with responses like “I have class,” or “no I’m doing homework.” But whenever someone else in this group asked if anyone wanted to hang out, they would respond saying that they would love to, which really hurt to see. I eventually cut ties with those college “friends” which I would now consider acquaintances. I feel so alone right now. Currently, I am dealing with a lot of general and social anxiety because I feel like I wasted part of life with these groups of people, and worry about future relationship investing. Every time I am with someone I know, I can’t tell if they are hanging out with me because they feel bad, or if they actually like being around me. I am afraid of investing into others because I don’t know if the same cycle will occur.  I hate feeling a combination of frustration, sadness, and loneliness, but I don’t want to come off as bitter. My stomach gets in knots when I think about these past and current events, but I feel that I need to get this written.  Did this group not like something about my personality? Were my expectations too high? Was I too intentional? I don’t like not getting answers, and I still feel that I don’t have any true friends. Loneliness is hard to deal with tbh. My mind is sometimes in constant worry, because I feel the same about dating. I don’t know if they’ll reciprocate. But I don’t want to become antisocial. Loneliness definitely plays a part in what I am experiencing, which adds onto the anxiety. Having to deal with a combination of both loneliness and anxiety SUCKS. I don’t really know how to handle what I am going through. Any advice?", "score": 8, "num_comments": 7, "url": "https://www.reddit.com/r/lonelinesssupport/comments/lcosa4/i_have_been_dealing_with_loneliness_and_social/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/lcosa4/i_have_been_dealing_with_loneliness_and_social/", "over_18": false, "removed_by_category": null}
{"id": "lap4s7", "subreddit": "lonelinesssupport", "created_utc": 1612246322, "author": null, "title": "How tf do you make friends?", "selftext": "I’m 16 and haven’t had a friend in 6 years. I was homeschooled for most of my life and have no social skills. Having social anxiety doesn’t help either but recently it’s been better. Like how do you talk to people!? I don’t relate to anything anyone says so I just sit there awkwardly. I play volleyball which is something most of the super social people do (ig they’re popular?idfk) but people still don’t talk to me...I should mention that I’ve been playing for 6 years so I’m experienced like them too. I’m quiet but that’s only because I don’t know what to do. I’m so lonely and I can’t even help myself which makes me so frustrated. I struggle with mental health enough as it is and I feel like things just keep getting worse for me. I’ve gotten better but I’m starting to fall apart again. I just don’t want to be alone. Thanks for reading this far and sorry this turned into a vent... it’s midnight and I’m tired and In tears. Also if it matters I’m 16", "score": 2, "num_comments": 0, "url": "https://www.reddit.com/r/lonelinesssupport/comments/lap4s7/how_tf_do_you_make_friends/", "permalink": "https://reddit.com/r/lonelinesssupport/comments/lap4s7/how_tf_do_you_make_friends/", "over_18": false, "removed_by_category": null}
{"id": "jhdd8y", "subreddit": "lonelinesssupport", "created_utc": 1603562175, "author": "misstterr_a", "title": "The one and only cure to loneliness", "selftext": "", "score": 2, "num_comments": 0, "url": "https://youtu.be/f3wCG0Lx1NE", "permalink": "https://reddit.com/r/lonelinesssupport/comments/jhdd8y/the_one_and_only_cure_to_loneliness/", "over_18": false, "removed_by_category": null}
{"id": "il91jw", "subreddit": "lonelinesssupport", "created_utc": 1599060903, "author": "johnnyberbz", "title": "LONELINESS| 7 PRACTICAL WAYS TO OVERCOME FEELING LONELY FAST! - JOHNNY B...", "selftext": "", "score": 1, "num_comments": 0, "url": "https://www.youtube.com/watch?v=Q7eMbtTKYrc&feature=share", "permalink": "https://reddit.com/r/lonelinesssupport/comments/il91jw/loneliness_7_practical_ways_to_overcome_feeling/", "over_18": false, "removed_by_category": null}
